[{"id":"49","title":"GPS - It's Not the Satellites That Know Where You Are","description":"There are a lot of misconceptions surrounding GPS technology and how it enters into our daily lives. Cheshire will spend this hour addressing some of this and answering all manner of questions on surveillance, new and old technology, and all sorts of other related topics.","timestamp":"1279274400","location":"Lovelace","speakers":[{"name":"The Cheshire Catalyst","bio":"(Richard Cheshire) is the former publisher of the notorious <i>TAP Newsletter<\/i> of the radical 1970s and 80s. He has also attended (and volunteered at) every HOPE Conference we've ever held."}]},{"id":"69","title":"IPv6 Playground: New Hope Update","description":"IPv6 Internet is expected to reach over 40 percent of all Internet traffic within the next four years. With this level of growth, expectations are that many new security problems will surface, as they did with IPv4. This presentation is an update to The Last HOPE discussion on the basics of IPv6. The topics will include updated methods of connecting to the IPv6 Internet, an update to the protocol, new attack vectors, new defenses, and a few new vulnerabilities.","timestamp":"1279274400","location":"Tesla","speakers":[{"name":"Joe Klein","bio":"has been teaching, researching, and hacking IPv6 for over eight year."}]},{"id":"102","title":"The State of Global Intelligence","description":"Our first speaker at our first conference back in 1994 is back to once again presents an overview of global intelligence. Smart Cities, Smart Corporations, Smart Nations are the ideal. The \"tribes\" of intelligence - academic, civil, commercial, government, law enforcement, military, and non-governmental - are almost catatonically stupid as well as corrupt in their information pathologies. There will also be a brief overview of his new book, <i>Intelligence for Earth: Clarity, Diversity, Integrity, and Sustainability,<\/i> which, like all of his books, is free online and for sale at cost at Amazon.","timestamp":"1279278000","location":"Tesla","speakers":[{"name":"Robert Steele","bio":"is the first public intelligence officer of the 21st Century. A recovering spy who signed the letter against torture and has generally condemned the current and past administrators of the various national intelligence elements in the USA, he has helped 90 countries get a grip on Open Source Intelligence (OSINT), and is today a pioneer of multinational, multifunctional information-sharing and sense-making. He has written a number of books, all of which will be on sale at half price on Saturday only, and is the host of three websites, http:\/\/www.oss.net (original), http:\/\/www.earth-intelligence.net (non-profit), and http:\/\/www.phibetaiota.net (front end for both and the main site for anyone interested in public intelligence of, by, and for the public."}]},{"id":"75","title":"Locational Privacy and Wholesale Surveillance via Photo Services","description":"With the plethora of third party services that allow folks to post photos to their Twitter account, how hard would it be for someone to stalk a person's location via the GPS metadata tagged in their images? Mayhemic Labs did the research and it turns out the answer is \"not very.\" Over the past few months, Mayhemic Labs has amassed a sizable database of people using these services - and what geographic information has been encoded on their publicly available photos. This presentation will cover the basics of how and why this research was done, why sharing such information is bad, why privacy is hard to get right, attempts at public outreach at ICanStalkU.com, how you can replicate such a system, and various instances of privacy fail. Also, tools will be released that will allow you to test your own (or other people's) photo streams.","timestamp":"1279278000","location":"Lovelace","speakers":[{"name":"Ben Jackson","bio":"is just another geek from Massachusetts. He spends his days doing InfoSec stuff, generally breaking things, and being relentlessly yet constructively paranoid for a large public sector organization in southern New England. In his spare time, he enjoys being a husband and dad, messing around with computers, VoIP, analog telephones, amateur radio, doing research as part of Mayhemic Labs, and generally pressing anything with a button on it. Ben was the lead author for <i>Asterisk Hacking<\/i> from Syngress Publishing, former host of <i>Binary Revolution Radio,<\/i> has spoken at Defcon, HOPE, Source Boston, QuahogCon, and various other conferences and strongly dislikes writing about himself in the third person."}]},{"id":"73","title":"Light, Color, and Perception","description":"The phenomenon of color has fascinated great minds from Newton to Picasso, and its complexities are still being unraveled. To understand light and the perception of color, you need physics, biology, psychology, and aesthetics - and this talk will cover a little about all of them. Along the way, topics will be touched upon like non-spectral colors, different color spaces, why laser light looks \"speckled,\" color-based optical illusions, and an intuitive explanation of the mysterious CIE chart. This material is rarely covered in either art or science classes and is a fascinating intersection of both.","timestamp":"1279278000","location":"Bell","speakers":[{"name":"Jonathan Foote","bio":"comes to the aesthetic sphere from a technical background. With a Ph.D. in electrical engineering and a scientific bent, he holds 34 U.S. patents and has over 60 scientific publications. His art work explores perception and interaction using a range of sophisticated electronics, from vintage vacuum tubes to the latest semiconductor devices. A San Francisco resident, he is a frequent hanger-on at the Noisebridge hackerspace there. He is a cofounder of the SWARM robotics collective, and his work has been shown at various Bay Area venues as well as internationally. More information on his work can be found at http:\/\/www.rotorbrain.com\/jtfdesign."}]},{"id":"94","title":"SHODAN for Penetration Testers","description":"SHODAN is a computer search engine unlike others. Instead of scouring the web for content, SHODAN scans for information about the sites themselves. The result is a search engine that aggregates banners from well known services. For penetration testers, SHODAN is a potential game changer as well as a gold mine of potential vulnerabilities.","timestamp":"1279281600","location":"Bell","speakers":[{"name":"Michael 'theprez98' Schearer","bio":"is a government contractor who spent nearly nine years in the United States Navy as an EA-6B Prowler Electronic Countermeasures Officer. His military experience includes aerial combat missions over both Afghanistan and Iraq and nine months on the ground doing counter-IED work with the U.S. Army. He is a graduate of Georgetown University's National Security Studies Program, a licensed amateur radio operator, and an active member of the Church of WiFi."}]},{"id":"112","title":"Wireless Security: Killing Livers, Making Enemies","description":"The message that wireless is unsafe has permeated the IT zeitgeist, however people still forget client devices. This talk by Dragorn and Renderman moves away from guarding the access points to guarding the clients. Considering the fun that is continually had by the authors at airports and public networks, this is a message that needs to get out.\r\nAttacks targeting client devices are becoming more sophisticated. Kismet Newcore makes breaking WEP a passive action. Airpwn has received a facelift and is now capable of more unspeakable actions over open links (hotels, airports). Karma as well is flypaper for clients running wireless without any thought to protection. Recent vulnerabilities in browsers and other protocols that are often dismissed as “too hard to exploit to be useful” are suddenly very possible and dangerous when wireless is involved, and attacks crossing from layer 2 directly to layer 7 vulnerabilities will be shown.","timestamp":"1279281600","location":"Tesla","speakers":[{"name":"Dragorn","bio":"is the author of the open-source wireless sniffer and IDS Kismet, as well as several other wireless-related open source projects such as spectrum analysis tools and drivers, LORCON packet injection, and others."},{"name":"RenderMan","bio":"is a Canadian born and raised hacker who spends way too much time figuring out ways of inserting electronics into treasured childhood toys. A frequent speaker at hacker and security cons around the world, he has also been an author on three books: <i>RFID Security,<\/i> <i>Kismet Hacking,<\/i> and <i>Seven Deadliest Wireless Technology Attacks,<\/i> all from Syngress. Consultant by trade, hacker by birth, black hat by fashion, co-refounder of the Church of Wifi, and recent member of the NMRC, he spends his time adding to his expansive collection of con badges and thinking of new ways to subvert wireless networks and childhood memories."}]},{"id":"30","title":"Content of the Future","description":"There are billions of cell phones and other mobile devices, computers, and dedicated readers in the world that can be used for reading eBooks and accessing other digital content. They may also be used for sharing, editing, annotating, and authoring. Is the future what the inventors of the digital revolution dreamed of? Yes and no. While digital content can be liberated and liberating, it is also being used to turn the masses into complacent consumer zombies. These wondrous tools for creating and sharing our own content might, at the same time, de-emphasize our ability to use the written word and logical thinking. In this session, the father of eBooks will share his thoughts on these topics and more. Despite corporate control and other negative forces, the liberation and proliferation of digital capabilities and content is changing the world for good, and will continue to do so. The session will discuss how software, creative thinking, and contributed labor have created the free digital content of today. More importantly, it will point the way to a future of content that achieves our dreams, and more.","timestamp":"1279281600","location":"Lovelace","speakers":[{"name":"Greg Newby","bio":"is a high-end computing technologist and information engineer. He has been with Project Gutenberg since 1991. His overarching goal is to make information and information systems more useable and accessible to all persons. He has been involved with HOPE conferences since 2000."},{"name":"Michael S. Hart","bio":"invented eBooks in 1971, and has spent nearly 40 years fostering the digitization and free distribution of eBooks and other digital content. He was a HOPE keynote speaker in 2006."}]},{"id":"71","title":"Keynote Address","description":" ","timestamp":"1279285200","location":"Tesla","speakers":[{"name":"Dan Kaminsky","bio":"is one of our keynote speakers at The Next HOPE. He has a widely respected history in the computer security world, probably best known for discovering the 2008 DNS cache poisoning vulnerability, a flaw which could allow attackers to easily perform cache poisoning attacks on any name server. He also was key in the Sony BMG CD copy protection scandal, where Sony was found to be complicit in installing rootkits on consumer computers, making them vulnerable to all sorts of malware. Dan estimated that Sony's rootkit had been installed on computers spanning more than 500,000 networks.<br \/>It's particularly thrilling for us to have Dan in attendance (it's also his first HOPE appearance) because he's able to present this material in an entertaining and accessible manner, unlike so many security experts who have trouble reaching an audience outside their field of expertise. This, after all, is our goal with all of our conferences - to reach as many people with varying levels of interest and ability as possible."}]},{"id":"40","title":"Examining Costs, Benefits, and Economics in Malware and Carding Markets","description":"Much has been made of the growth of online black markets in Russia and Eastern Europe that facilitate the sale and distribution of tools and information designed to subvert and compromise computer networks and users. Specifically, web forums allow individuals to purchase access to sophisticated malicious software to victimize vulnerable systems and individuals, and sell the data they illegally obtain for a profit. While it is clear that malicious actors can acquire myriad resources to facilitate criminal activity, it is not clear what the return on investments is like relative to the costs of buying goods and services through these markets. This qualitative study examines this issue through an economic analysis of a sample of threads from ten active publicly accessible web forums that traffic in malware and personal information. Specifically, this talk will consider the costs of trojans, botnets, iframes tools, spam, DDoS services, and credit card information for victims and offenders to estimate dollar losses for victims relative to the economic gains for offenders who utilize and provide these resources. The findings will give significant insight into the role of malware and carding forums in the problem of cybercrime and the prospective economy revolving around computer intrusions and compromises. In turn, this talk can benefit computer security professionals, law enforcement, and anyone interested in better understanding cybercrime from the offender perspective.","timestamp":"1279288800","location":"Bell","speakers":[{"name":"Dr. Thomas J. Holt","bio":"is an assistant professor in the School of Criminal Justice at Michigan State University. His research focuses on computer hacking, malware, and the role that technology and the Internet play in facilitating all manner of crime and deviance. Dr. Holt has published in various academic journals including <i>Crime and Delinquency, Deviant Behavior,<\/i> and the <i>Journal of Criminal Justice,<\/i> is a coauthor of <i>Digital Crime and Digital Terror,<\/i> and serves on the editorial board of the <i>International Journal of Cyber Criminology.<\/i>"}]},{"id":"35","title":"<i>Digital<\/i>: A Love Story","description":"Earlier this year, author Christine Love released a computer game called <i>Digital: A Love Story,<\/i> an interactive adventure based about BBSes, hacking, and science fiction. Taking place in 1988, Love created a game that took place one year before she was born, utilizing textfiles.com as a research source for historical fiction. Textfiles.com's Jason Scott will interview Christine about the inspiration and creation of this game, what the BBS era offers as a story background, and a glimpse into how future generations will look at the hackers of today.","timestamp":"1279288800","location":"Lovelace","speakers":[{"name":"Christine Love","bio":"is writer of all sorts of fiction, especially science fiction and romances, and an occasional professional programmer. She has studied '80s hacking and computer culture only well after the fact, and perhaps romanticizes the era a little too much. When not writing novels or computer game narratives, she is a full time student of English literature and history, located just outside of Toronto."},{"name":"Jason Scott","bio":"is a computer historian known for either his website textfiles.com, his documentaries <i>BBS<\/i> and <i>Get Lamp,<\/i> his Twittering cat Sockington, his presentations and speeches at many different conventions, or his insistence on never shutting up. He lives a little north of here."}]},{"id":"38","title":"Electronic Take Back","description":"Discarded electronic products contain many toxic substances which can pollute the environment and threaten human health. Many countries in the world require the manufacturer to be financially responsible for the collection and recycling of their discarded products, which provides an economic incentive to make the products less toxic and more recyclable. More and more U.S. states are adopting electronic take back laws. This talk will review the concept and practice of electronic take back, its track record in the E.U. and in the U.S., and why IT pros and IT security practitioners who want to support good environmental practices should support it.","timestamp":"1279292400","location":"Bell","speakers":[{"name":"John McNabb","bio":", an IT Pro from the Boston area, worked for ten years for Clean Water Action, where he spearheaded efforts to pass electronic take back laws in Massachusetts and supported national efforts to pass such laws. He also worked for six years as a legislative liaison for the Massachusetts Department of Environmental Protection."}]},{"id":"17","title":"Arse Elektronika: Sex, Tech, and the Future of Screw-It-Yourself","description":"We may not forget that mankind is a sexual and tool-using species.\r\nFrom the depiction of a vulva in a cave painting to the newest Internet porno, technology and sexuality have always been closely linked. New technologies are quick to appeal to pornography consumers, and thus these customers represent a profitable market segment for the suppliers of new products and services.\r\nCurrently, all factors show that high-tech developments owe a great deal of their success to the need for further sexual stimulation. One could cite the example provided by the science fiction concept of a full-body interface designed to produce sexual stimulation. But it isn't science fiction anymore. It's DIY.\r\nAs bio-hacking, sexually enhanced bodies, genetic utopias, and plethora of gender have long been the focus of literature, science fiction and, increasingly, pornography, this year will see us explore the possibilities that fictional and authentic bodies have to offer. Our world is already way more bizarre than our ancestors could have ever imagined. But it may not be bizarre enough. \"Bizarre enough for what?\" you might ask. Bizarre enough to subvert the heterosexist matrix that is underlying our world and that we should hack and overcome for some quite pressing reasons within the next century.\r\nDon't you think, replicants?","timestamp":"1279292400","location":"Tesla","speakers":[{"name":"Johannes Grenzfurthner","bio":"is an artist, writer, curator, and director. He is the founder of monochrom, an internationally acting art and theory group. He holds a professorship for art theory and art practice at the University of Applied Sciences in Graz, Austria. He is head of the 'Arse Elektronika' festival in San Francisco, host of 'Roboexotica' (Festival for Cocktail-Robotics, Vienna and San Francisco), and curates the Paraflows Conference inVienna. Recurring topics in Johannes' artistic and textual work are contemporary art, activism, performance, humor, philosophy, postmodernism, media theory, cultural studies, sex tech, popular culture studies, science fiction, and the debate about copyright."}]},{"id":"21","title":"Botnet Resistant Coding: Protecting Your Users from Script Kiddies","description":"Zeus botnets are trojans accountable for a large percentage of all trojan infections. Zeus's availability and ease of use make it popular amongst malicious individuals with low technical sophistication. Better social engineering scams, coupled with consistent levels of victim unawareness and carelessness on the part of software vendors, have created a need for greater web security. Using a standard LAMP stack and web programming techniques, a guideline was developed to mitigate and reduce the exposure of sensitive information from compromised clients. Because of the resultant confusion, attackers have either given up and moved on to an easier target, or have spent significant amounts of resources undoing damage to harvested POST data. The immediate objective of implementing these new techniques is to reduce the efficacy of Zeus and its counterparts and ebb cybercrime and identity fraud. Future use of these techniques will provide better chances against the compromising of users and web applications.","timestamp":"1279292400","location":"Lovelace","speakers":[{"name":"Fabian Rothschild","bio":"is a Miami college student leading malware research for HackMiami and has presented his research on ZeuS for South Florida OWASP. He is a consultant for small and medium businesses providing best security practices for application development. He enjoys programming in Python and running Linux."},{"name":"Peter Greko","bio":"is a Miami security researcher, board member of HackMiami, and an application analyst specializing in web security for a Fortune 20 company. Pete gives presentations to programming classes on web security practices and has presented for both HackMiami and the south Florida ISSA chapter meetings."}]},{"id":"96","title":"<i>Sita Sings the Blues:<\/i> A Free Culture Success Story","description":"\"If it's free, how do you make money?\" One year after the Copyleft release of her animated musical feature <i>Sita Sings the Blues,<\/i> Nina Paley presents the latest round of hard data from the project. Contrary to MPAA propaganda, the more the audience freely shares the film, the more they purchase DVDs, theater admissions, and merchandise. In this talk, witness the numbers that prove it.","timestamp":"1279296000","location":"Lovelace","speakers":[{"name":"Nina Paley","bio":"is based in New York. She is a culture hacker and 'free culture' advocate. Nina made the film <i>Sita Sings the Blues,<\/i> possibly the first commercially viable feature film released under CopyLeft (CC-by-sa) at http:\/\/www.sitasingstheblues.com\/. She often give talks about how she make money with a 'free' film. She is also artist-in-residence at QuestionCopyright.org, with whom she makes <i>Minute Memes,<\/i> short animations about intellectual freedom."}]},{"id":"85","title":"Own Your Phone","description":"Ever wonder what makes your phone work... and how to make it work in ways that were never intended? You might be a phreak! Phreaking is one of the most exciting and fastest-changing scenes in the hacker landscape. Join TProphet and phriends for a phun look at some of the newest innovations.","timestamp":"1279296000","location":"Tesla","speakers":[{"name":"TProphet","bio":", also known as 'The Telecom Informer,' is a longtime columnist for <i>2600 Magazine.<\/i> Beginning his phreaking career at the age of 11, TProphet has taken payphone pictures on six of seven continents."}]},{"id":"31","title":"Cooking for Geeks","description":"Are you interested in the science behind what happens to the food in your kitchen? Do you want to learn what makes a recipe work so you can improvise instead of simply following a set of instructions? In this talk, Jeff Potter, author of the forthcoming O'Reilly book <i>Cooking for Geeks<\/i>, will share the key insights into what happens in the kitchen from a geek perspective so that you can improvise and create your own unique dishes.","timestamp":"1279296000","location":"Bell","speakers":[{"name":"Jeff Potter","bio":"has done the cubicle thing, the startup thing, and the entrepreneur thing, and through it all maintained his sanity by cooking for friends. He studied computer science and visual art at Brown University."}]},{"id":"33","title":"Design of a Wireless EMG","description":"This talk is a summary of all the steps taken in designing a wireless EMG. Such a device is capable of using the faint electrical signals that muscles give off when used in controlling other systems. Konstantin’s current design is a combination of power supply circuitry to run off a lithium-ion battery, a nRF24l01+ chip for wireless capability, a PIC 18F4550 as the brains of the device, and an amplification board to amplify EMG signals. This presentation will show how each of these elements come together to create a wireless EMG. The talk will cover the sections of design, manufacture, testing, coding, and future work.","timestamp":"1279299600","location":"Bell","speakers":[{"name":"Konstantin Avdashchenko","bio":"received his B.S. in electrical engineering from Union College while minoring in nanotechnology. He has always loved to build everything he could, since only then could he call it 'his own.'"}]},{"id":"70","title":"Keeping Your Job While Being a Hacker","description":"Hackers are curious above all other things. While we all think this trait should be rewarded (or at least not punished so much), sometimes employers don't agree. As a lawyer, Alex has had more phone calls than he'd like from employees who were fired once they reported a security hole - or even showed an interest in hacking. This talk will discuss a few case studies, U.S. law, and some recommendations on how to protect your job while remaining an active hacker (or merely a curious person).","timestamp":"1279299600","location":"Tesla","speakers":[{"name":"Alex Muentz","bio":"is a geek and a lawyer. When he's not trying to keep his clients out of trouble, he teaches about the collision of law and technology and tries to be useful to his fellow geeks."}]},{"id":"22","title":"\"Brilliants Exploits\" - A Look at the Vancouver 2010 Olympics","description":"With the 2010 Winter Olympics having come and gone, it's not too late to look back at what an event it was. From a technology standpoint, CCTV cameras and ticket sales will be looked at, and from a social standpoint, matters involving intellectual property as well as the police will be examined.","timestamp":"1279299600","location":"Lovelace","speakers":[{"name":"Colin Keigher","bio":"is a systems administrator living in the metro Vancouver area and an active member of the Vancouver Hack Space (hackspace.ca). A lot of what he does with his spare time is documented on his blog at keyboardcowboy.ca. You'll also find him as 'afreak' on irc.2600.net."}]},{"id":"84","title":"The OpenAMD Project","description":"The badge for The Next HOPE is the result of a collaboration of several people over the last 11 months. Hardware, software, social interactivity, and more. This panel will cover how the badge works, how we keep track of where you are at the conference, what cool games you can play, and perhaps some clues to a few of our kule s3cr3ts.","timestamp":"1279303200","location":"Lovelace","speakers":[{"name":"Aestetix","bio":"was last seen wandering the labyrinth searching for the Knights Templar."},{"name":"cpfr","bio":"is a data scientist. His latest research interests include facial recognition and extracting emotions from text."},{"name":"Echo","bio":"is a visual artist in an ongoing effort to combine data analysis and pretty pretty visuals."},{"name":"Far McKon","bio":"is the cofounder of Hive76, a Philadelphia hackerspace, and instigator of weird and interesting projects, and a ginger."},{"name":"Mitch Altman","bio":"is the brains behind Cornfield Electronics, and one of the cofounders of the Noisebridge hackerspace in San Francisco. Mitch is best known as the inventor of TV-B-Gone, but his list of hacks and cool electronics includes a lot of other intriguing projects. When he is not at Noisebridge making and teaching, he is on the road from hackerspace to Hacker-Con and back again, sharing his love of electronics."},{"name":"Travis Goodspeed","bio":"is a belt buckle engineer from southern Appalachia with a hobby of exploiting and reverse engineering embedded systems. Recently, he discovered a PRNG vulnerability of the key exchange protocol used by many ZigBee Smart Energy Profile devices. He is known to carry absurd quantities of GoodFET JTAG debugger boards, giving them out to any and all neighbors."}]},{"id":"74","title":"Lisp, The Oldest Language of the Future","description":"Being the second oldest high-level language still in widespread use (after Fortran), Lisp is often considered solely as an academic language well-suited for artificial intelligence. It is sometimes accused of having a (very (strange syntax)), only using lists as data types, being difficult to learn, using lots of memory, being inefficient and slow, as well as being dead, an ex-language. This talk, focusing on Common Lisp, aims to show that it is actually an elegant, unique, expressive, fast, extensible language for symbolic computation that is not difficult to learn and may even change the way you think about programming. Lisp is primarily a functional paradigm language, but supports object-oriented, imperative, and other programming models natively. Rapid prototyping, iterative development, multiprocessor development, and creation of domain-specific languages are all facilitated by Lisp. There will be a discussion of the origins and history of Lisp, followed by a demonstration of the language, features that migrated to and from other languages, and concluding with a look to what may be in store for the future.","timestamp":"1279303200","location":"Bell","speakers":[{"name":"Adam Tannir","bio":"is an autodidact with a corporate day job. With more than passing interests in various sciences, computation, art and education, he likes to share his insights and realizations with whomever he can, combining concepts so the world makes more sense. He is currently learning about the Android platform, microcontrollers and electronics, and how to improve his cooking skills. Plutarch reminds us: 'The mind is a fire to be kindled, not a vessel to be filled.'"}]},{"id":"106","title":"Tor and Internet Censorship","description":"The Tor project has seen an increased focus on Internet censorship as many more users adopted Tor to get around blocking. In the past year, Tor was a popular means of bypassing censorship in Iran, China, and around the world. Firewall operators have been noticing. Tor has also had to contend with new organized efforts to block access to the network, and has rolled out the \"bridges\" blocking-resistance system in earnest. Alongside the perpetual need to get more Tor nodes, it's become important to get users to run bridges - and to experiment with ways of communicating bridge addresses to users affected by censorship.\r\nThe current censorship landscape will be explored, along with the bridge mechanism and efforts to recruit more bridges. There will also be an update on how Tor developers are responding to the growing pains and dealing with scaling challenges associated with Tor's popularity. You’ll also hear about the challenge of counting the number of users on an anonymity network, and how client software can force the use of encryption to protect users from some attacks after their traffic leaves the Tor network.","timestamp":"1279303200","location":"Tesla","speakers":[{"name":"Jacob Appelbaum","bio":"is a photographer and independent computer security researcher. He is currently employed by the Tor Project. He is ambassador for the art group monochrom and has researched cold boot attacks and MD5 collisions, among other projects. Jacob is a founder of the hackerspace Noisebridge, located in San Francisco."},{"name":"Seth Schoen","bio":"is a senior staff technologist at the Electronic Frontier Foundation. He has worked at EFF for eight years, helping other technologists to understand the civil liberties implications of their work, the EFF staff to better understand the underlying technology related to EFF's legal work, and the public to understand what the technology products they use really do. He helped create the LNX-BBC live CD and has researched phenomena including laser printer forensic tracking codes, ISP packet spoofing, and key recovery from computer RAM after a computer has been turned off. He is secretary of the Noisebridge hackerspace."}]},{"id":"37","title":"Easy Hacks on Telephone Entry Systems","description":"Telephone entry systems are practically everywhere in the city. An investigation after a series of break-ins uncovered several shockingly simple bypass techniques currently used by criminals. This presentation explains how the common keypad box will grant full access to a building in under ten seconds using only basic tools. The presentation will also give details on a series of countermeasures that can significantly reduce the vulnerabilities.","timestamp":"1279306800","location":"Lovelace","speakers":[{"name":"Davi Ottenheimer","bio":"has over 16 years of experience managing global security operations and assessments, including a decade of leading incident response and digital forensics."}]},{"id":"26","title":"Buying Privacy in Digitized Cities","description":"As new sensing technologies appear in our cities almost overnight, what does it mean to be visible or invisible? What happens when socioeconomic categories determine when, where, and how you're seen? The asymmetry in who is visible, and where, is a long-standing urban problem, but it is now being built into our technologies and our cities.\r\nThe worlds of advertising, city planning, and law enforcement are each creating their own inconsistent visions. Privacy is not dead; rather, it is being selectively vivisected. What can we do to fix this? In this talk, a lot of problems and a few solutions will be covered, including the announcement of a new competition for the development of tactical countersurveillance tools.","timestamp":"1279306800","location":"Bell","speakers":[{"name":"Eleanor Saitta","bio":"is a designer, artist, hacker, and researcher working at the intersections between mediums ranging from interaction design and architecture to fashion, with an emphasis on the seamless integration of technology into lived experience and the humanity of objects and the built environment. She has previously worked at the NASA Ames Research Center and the IBM Almaden Research Center, and lives mostly in New York."}]},{"id":"41","title":"Extreme Lockpicking","description":"Barry Wels and Han Fey are back with the newest developments in locks and lockpicking, including bypassing hotel door security and layered attacks on new high security locks. A special on-stage camera will let you see inside the locks while Barry and Han use their techniques to open them. Throughout the conference, they will conduct hands-on lockpicking tutorials and other fun activities in the Lockpicking Village, where you can bring interesting locks (keys optional) for analysis and testing.","timestamp":"1279306800","location":"Tesla","speakers":[{"name":"Barry Wels","bio":"earned his nickname 'The Key' when he started picking locks around 1985. He cofounded the infamous Dutch hacker magazine <i>Hack-Tic<\/i> where he first started publishing articles on lockpicking. He has done talks and workshops at numerous European hacker events and at HOPE conferences for nearly two decades, operates a security consulting company, and is also cofounder of Cyptophone, a secure mobile phone company. As with mechanical locks, Barry believes in security through transparency, not obscurity."},{"name":"Han Fey","bio":"is a mechanical engineer and a passionate lock collector from Europe. He is well-known for his in-depth articles on high security locks (downloadable at http:\/\/www.toool.nl). Because of his articles and reputation, lock companies worldwide invite him to their factories and ask his advice on improving their lock products. Han is also very active in lock R&amp;D, testing, forensic research, and training people in the lock and security industry."}]},{"id":"79","title":"Monkeysphere: Fixing Authentication on the Net","description":"Most modern public key infrastructure is built around notions of centralized authority, which is troublesome for those of us who want decentralized secure communications on the global network. Monkeysphere is a project to extend the OpenPGP Web of Trust into as many domains as possible, effectively supplanting hierarchical certification infrastructure like X.509, and restoring control over authentication and identification to the communications peers themselves and their own legitimately trusted introducers. Functional tools for authenticating peers over the World Wide Web and SSH have been introduced, with plans for more protocols. Come learn how the tools work, how you can take advantage of the Web of Trust in your own projects, and how you can contribute to building a more autonomous and decentralized global network.","timestamp":"1279310400","location":"Bell","speakers":[{"name":"Daniel Kahn Gillmor","bio":"is a freelance technology advisor and free software developer. He participates in the Debian project with a focus on usable cryptographic infrastructure, rides bikes, cooks, and manages to stay out of trouble most of the time."},{"name":"Jameson Rollins","bio":"is a physicist looking for the elusive gravitational wave. In his spare time, he likes to work on free software, ride his bike, and drink beer."}]},{"id":"107","title":"Towards Open Libraries and Schools","description":"You can wear your \"No, I won't fix your computer\" shirt, or you can try to make progress with the bureaucrats, teachers, bosses, and other tech n00bs who make maintaining the systems in your life utterly frustrating. In this panel, organized and moderated by <i>Off The Hook<\/i> participant Gus Andrews, two veterans of the battle to wire under-served areas talk about what works and what doesn't when helping the uninitiate learn about the Internet, privacy issues, security, and proprietary software. Jessamyn West, blogger at librarian.net and a MetaFilter manager, will talk about her efforts to educate librarians and patrons about the PATRIOT Act and digital literacy, and her technology advocacy with the American Library Association. Ellen Meier, a professor at Columbia University Teachers College who presses for greater access to the Internet and more pervasive use of technology in classrooms, will talk about what works and what doesn't when working with educators and with administrators in Albany. The panel will welcome discussion, questions, and frustrations from audience members dealing with similar problems.","timestamp":"1279310400","location":"Lovelace","speakers":[{"name":"Ellen Meier","bio":"is co-director of the Center for Technology and School Change at Teachers College, and associate professor of practice, computing, and education. She also co-chairs the Regents-appointed Council for Technology Policy and Practice for New York. Her research examines the role of technology in creating more engaging learning environments and in catalyzing school change. She has worked extensively with metropolitan schools to study the integration of digital tools in ways that improve educational practice."},{"name":"Gillian 'Gus' Andrews","bio":"recently received her doctorate in Internet confusion, having completed a dissertation on why people show up on unsuspecting blogs and think they are writing directly to Oprah or Bill Gates. She has written about similar confusions for ReadWriteWeb, and previously investigated the suffering of first-time <i>Second Life<\/i> users for Linden Lab. She is a periodic commentator on <i>Off The Hook,<\/i> and writes, edits, directs, and puppeteers for <i>The Media Show,<\/i> an award-winning YouTube show about digital and media literacy."},{"name":"Jessamyn West","bio":"is a community technology instructor, writer, and public librarian in Randolph, Vermont. She is a community moderator at MetaFilter, runs librarian.net, and has been blogging since 1997. Over the years, she has campaigned for smarter library technology policies, having been an at-large councilor for the American Library Association and a co-editor on the book <i>Revolting Librarians Redux.<\/i>"}]},{"id":"23","title":"Build Robots and See the World","description":"Computing and electronics parts are inexpensive enough these days to allow amateurs to build surprisingly sophisticated machines on a budget. Jonathan will talk about his experiences building kinetic artworks like Chassis the Drink-Serving Robot and SWARM, the collection of six spherical orbs that roll without wheels. He will discuss how it got started, how the robots work, and how knowing what you are doing is not always the best approach. Although they haven't quite achieved world domination, he and his collaborators have exhibited robots at the Coachella Music Festival, the International Festival of Cocktail Robotics in Vienna, as well as the Techkriti Festival in Kanpur, India. The interested beginner will wind up with a bunch of tips and sources for getting started in robotics.","timestamp":"1279310400","location":"Tesla","speakers":[{"name":"Jonathan Foote","bio":"comes to the aesthetic sphere from a technical background. With a Ph.D. in electrical engineering and a scientific bent, he holds 34 U.S. patents and has over 60 scientific publications. His art work explores perception and interaction using a range of sophisticated electronics, from vintage vacuum tubes to the latest semiconductor devices. A San Francisco resident, he is a frequent hanger-on at the Noisebridge hackerspace there. He is a cofounder of the SWARM robotics collective, and his work has been shown at various Bay Area venues as well as internationally. More information on his work can be found at http:\/\/www.rotorbrain.com\/jtfdesign."}]},{"id":"53","title":"Hackerspaces Forever: A Panel Presented by Hackerspaces.org (2 hours)","description":"Nick Farr (HacDC, Washington DC, USA), Mitch Altman (Noisebridge, San Francisco, USA), Sean Bonner (Crashspace, Los Angeles, USA \/ HackspaceSG, Singapore), Johannes Grenzfurthner (hackbus.at, Vienna, Austria), Markus \"fin\" Hametner (Metalab, Vienna, Austria), Alexander Heid (HackMiami, Miami, FL, USA), Nathan \"JimShoe\" Warner (Makers Local 256, Huntsville, AL, USA), Matt Joyce (NYC Resistor, Brooklyn, NY, USA), Carlyn Maw (Crashspace, Los Angeles, CA, USA), Far McKon (Hive 76, Philadelphia, PA, USA), Psytek (Alpha One Labs, Brooklyn, NY, USA)\r\nWe called your excuses invalid at The Last HOPE and you proved us right! Since launching hackerspaces.org at The Last HOPE, there's been phenomenal worldwide growth in the hackerspaces movement. Continuing to build on progress, this panel discussion brought to you by Hackerspaces.org will focus on strategies to help avoid drama, grow your hackerspace, and connect with your community.","timestamp":"1279314000","location":"Tesla","speakers":[{"name":"Alexander Heid","bio":"is an information security researcher from Miami. He is a founding member of HackMiami, a hackerspace in south Florida, and is also a board member for the south Florida OWASP organization. Alexander was quoted by <i>Technology Review Magazine<\/i> in February 2010 regarding research on the Zeus trojan and antivirus evasion techniques. He is currently employed as a vulnerability analyst for a Fortune 20 financial firm."},{"name":"Carlyn Maw","bio":"is the dominant force behind the function of the Crashspace hackerspace in Los Angeles."},{"name":"Far McKon","bio":"is the cofounder of Hive76, a Philadelphia hackerspace, and instigator of weird and interesting projects, and a ginger."},{"name":"Johannes Grenzfurthner","bio":"is an artist, writer, curator, and director. He is the founder of monochrom, an internationally acting art and theory group. He holds a professorship for art theory and art practice at the University of Applied Sciences in Graz, Austria. He is head of the 'Arse Elektronika' festival in San Francisco, host of 'Roboexotica' (Festival for Cocktail-Robotics, Vienna and San Francisco), and curates the Paraflows Conference inVienna. Recurring topics in Johannes' artistic and textual work are contemporary art, activism, performance, humor, philosophy, postmodernism, media theory, cultural studies, sex tech, popular culture studies, science fiction, and the debate about copyright."},{"name":"Markus 'fin' Hametner","bio":"is less serious than Nick Farr, except when he's fixing problems at the Metalab in Vienna or being the sysadmin for hackerspaces.org."},{"name":"Matt Joyce","bio":"was once banned from HOPE, and twice spoken at HOPE. He's part of NYCResistor, founded MakeNYC, and built several electronics projects featured in <i>Make<\/i> and <i>BoingBoing<\/i>."},{"name":"Mitch Altman","bio":"is the brains behind Cornfield Electronics, and one of the cofounders of the Noisebridge hackerspace in San Francisco. Mitch is best known as the inventor of TV-B-Gone, but his list of hacks and cool electronics includes a lot of other intriguing projects. When he is not at Noisebridge making and teaching, he is on the road from hackerspace to Hacker-Con and back again, sharing his love of electronics."},{"name":"Nathan 'JimShoe' Warner","bio":"(Makers Local 256, Huntsville, AL, USA) is the former chairman and charter member of Makers Local 256."},{"name":"Nick Farr","bio":"is an accountant based in Washington, D.C. He's been called the 'Johnny Appleseed' of the hackerspaces movement in the United States."},{"name":"Psytek","bio":"is an inventor and engineer currently building a flying saucer at Alpha One Labs in Brooklyn."},{"name":"Sean Bonner","bio":"is a founder of Crash Space and a member of HackerspaceSG"}]},{"id":"68","title":"Introduction to the Chip Scene: Low Bit Music and Visuals","description":"This talk will focus on the global chip scene, an ever growing group of electronic artists that use low-bit and hacked computer and video game consoles to create music and video. Peter Swimm of <i>True Chip Till Death<\/i> will give an overview of the chip scene past and present. <i>True Chip Till Death<\/i> is the leading news site of the scene, providing thousands of fans with the latest news on releases, hard- and software, and live events. Joey Mariano and Don Miller will focus on the creation of music and visuals. Mariano, better known as Animal Style, is a musician from Philadelphia who creates music on the Nintendo Game Boy and Sega Genesis. He will give an introduction to various trackers, the tools most chip musicians use to create low-bit music. Miller, also known as NO CARRIER, will be discussing real time visuals. He'll show you how to use your Nintendo Entertainment System, the Commodore 64, and other classic hardware to create live video for chip music events.","timestamp":"1279314000","location":"Lovelace","speakers":[{"name":"Don Miller","bio":"performs live visuals in real time under the alias NO CARRIER. He works with nearly obsolete repurposed electronics to create high energy low resolution abstract video. Part of the 8bitpeoples artist collective, he performs, exhibits, and lectures worldwide. Miller is based in Philadelphia, where he organizes and curates 8static, a monthly showcase of low-bit music and visuals."},{"name":"Joey Mariano","bio":"is an American guitar virtuoso, chip musician, visual artist, and educator hailing from Philadelphia. Better known as Animal Style, his music is a blend of demoscene sensibilities, catchy melodies, organic guitar riffs, and improvisation that will explode your ear canal and leave you begging for more. Mariano stands at the forefront of the emerging chip scene in Philadelphia and is a frequent coconspirator with 8bitpeoples, the New York chip scene, and http:\/\/iimusic.net."},{"name":"Peter Swimm","bio":"has edited the daily chip music news blog <i>True Chip Till Death<\/i> (http:\/\/www.truechip.org) since 2008. He also records and performs his own low-bit music, helped found the monthly Pulsewave Chip Music concert series (now entering its fourth year), and has helped blog for Blip Festival since 2008."}]},{"id":"91","title":"Risk Analysis for Dummies","description":"We all get that \"gut feeling\" about what is risky, but how do we communicate that to managers or other people in a meaningful way? And how can we determine what risks are worse than others in a justifiable manner? How do you even define \"risk?\" In this talk, you’ll learn about the most up to date methods of identifying risk, evaluating risk, and communicating risk to others, as well as some models used by the U.S. government and others to identify attack targets, evaluate building security, diagram attacks, and more. And no math problems harder than simple addition, guaranteed.","timestamp":"1279314000","location":"Bell","speakers":[{"name":"Nick Leghorn","bio":"(Foghorn to his friends) graduated from Pennsylvania State University with a degree in security and risk analysis, and is currently employed as a risk analyst for a contractor working for the Department of Homeland Security. Nick is also an EMT, a general class amateur radio operator, started the State College <i>2600<\/i> meeting, and runs a competition shooting team in his spare time. More information can be found via his website: http:\/\/NickLeghorn.com."}]},{"id":"39","title":"Electronic Waste: What's Here and What's Next","description":"Electronic waste is a problem that dogs technology buyers, system administrators, electronics manufacturers, and especially people who engage in informal - and often dangerous and toxic - disassembly. This talk will outline the history and scope of the problem, the environmental justice implications, the regulatory environment, industries that may be poised to face or prevent similar issues, and what we as technology workers can do to turn the tide.","timestamp":"1279317600","location":"Lovelace","speakers":[{"name":"Stephanie Alarcon","bio":"is a tree-hugging, bike-riding, turntable-loving, science-fetishizing UNIX geek. By day she runs servers for the University of Pennsylvania where she is wrapping up a Master of environmental studies. In her free time, she serves on the board of Philadelphia hackerspace Hive76, works on a few urban farming projects, and engages in an unhealthy codependency with her never-quite-finished 100-year-old house, which she has populated with friendly nerds, a small herd of cats, and a whole kitchen dedicated to science."}]},{"id":"34","title":"Detecting and Defending Your Network from Malware Using Nepenthes","description":"Security analysts have a tendency to believe they are safe because the red alert light hasn't blinked on their IDS\/IPS device. This remains true even when organizations have invested the time and budget to deploy a myriad of different tools to defend against the overwhelming number of network defense issues we all tend to face. A key pain point among these issues is keeping malware and the subsequent bot herders who spread it off of your corporate network.\r\nNepenthes is an open source honeypot that allows for the collection of malware “in the wild.” It emulates known vulnerabilities and will download and capture the malware when it is attempting to compromise the honeypot. This collection process allows for further analysis and understanding of the malware in question. This presentation introduces this powerful and flexible tool and will discuss malware collection techniques attendees will immediately be able to take home and implement within their network environment and add another layer to their “defense in depth” strategy.","timestamp":"1279317600","location":"Bell","speakers":[{"name":"Marco Figueroa","bio":"is a senior security analyst consultant whose technical expertise includes reverse engineering of malware, incident handling, hacker attacks, tools, techniques, and defenses. He has performed numerous security assessments and responded to computer attacks for clients in various market verticals."}]},{"id":"48","title":"<i>Get Lamp<\/i> Screening and Discussion","description":"In the early 1980s, an entire industry rose over the telling of tales, the solving of intricate puzzles, and the art of writing. Like living books, these games described fantastic worlds to their readers, and then invited them to live within them. They were called \"computer adventure games,\" and they used the most powerful graphics processor in the world: the human mind. Rising from side projects at universities and engineering companies, adventure games would describe a place, and then ask what to do next. They presented puzzles, tricks, and traps to be overcome. They were filled with suspense, humor, and sadness. And they offered a unique type of joy as players discovered how to negotiate the obstacles and think their way to victory. These players have carried their memories of these text adventures to the modern day, and a whole new generation of authors have taken up the torch to present a new set of places to explore. <i>Get Lamp<\/i> is a documentary that tells the story of the creation of these incredible games, in the words of the people who made them. Director Jason Scott has previously created <i>BBS: The Documentary,<\/i> partially filmed at HOPE, and will be on hand to introduce and show the documentary, as well as talk about the production of <i>Get Lamp<\/i> and his filmmaking, including lessons learned, trivia and stories told, and how exactly one goes about minting a commemorative coin.","timestamp":"1279321200","location":"Tesla","speakers":[{"name":"Jason Scott","bio":"is a computer historian known for either his website textfiles.com, his documentaries <i>BBS<\/i> and <i>Get Lamp,<\/i> his Twittering cat Sockington, his presentations and speeches at many different conventions, or his insistence on never shutting up. He lives a little north of here."}]},{"id":"65","title":"Injecting Electromagnetic Pulses into Digital Devices","description":"This talk is not about someone on the ground firing a ray gun at a jet and bringing it down. This talk is about someone on the jet injecting EMP into the wiring system and causing great problems with the aviation and the black box. This talk will have at least ten video demos of device pulses and one of a surge protector, along with explanations of a Marx generator and a MOSFET charging circuit. Going green, fly by wire airplanes, robotic control trains, densely integrated systems... these are all realities of our daily environment. One problem is that all of these make our lives more susceptible to an EMP disruption. Other topics will include TWA 800, Tesla coils, Byzantine faults and the power grid.","timestamp":"1279321200","location":"Bell","speakers":[{"name":"Paul F. Renda","bio":"started his career working on the IBM 360 and the PDP 11. He was an early advocate of using hacking software to check corporate data systems and has presented talks at the Computer Security Institute. Paul's articles have appeared in <i>Info Security Magazine.<\/i> In 1995, Paul developed a defense against war dialers. He is currently a computer security analyst and futurist."}]},{"id":"66","title":"Interaction with Sensors, Receivers, Haptics, and Augmented Reality (90 minutes)","description":"Electronic sensor technology has been increasing in resolution while decreasing in cost. The ubiquity of GPS receivers has created the ability to obtain location-based information on demand. At the same time, Augmented Reality interfaces are becoming more popular in the consumer market. From the micro-level of delicate touch sensors in haptic interfaces to the macro-level of GPS positioning, these trends make physically interactive computing more and more accessible. This session will provide an overview of motion\/light\/heat sensors, GPS receivers, haptic interfaces, and other interactive electronics. Along with an explanation of how they work, several projects that utilize these technologies in the consumer, creative, and social realms will be covered. There will be an audience participation section where users will get a chance to explore sensors and electronics themselves.","timestamp":"1279321200","location":"Lovelace","speakers":[{"name":"Elle Mehrmand","bio":"is a performance\/new media artist and musician who uses the body, electronics, video, sound, and installation within her work. She is the singer and trombone player of Assembly of Mazes, a music collective who create dark, electronic, Middle Eastern, rhythmic jazz rock. Elle is currently an MFA candidate at UCSD, and received her BFA in art photography with a minor in music at CSULB. Elle has received grants from UCIRA, the Russell Foundation, and Fine Arts Affiliates. She is a researcher at CRCA and the b.a.n.g. lab at UCSD. Her performances have been shown in Long Beach, Los Angeles, Tijuana, Montreal, Dublin, San Diego and Bogota. Her work has been discussed in <i>Art21,<\/i> the <i>Los Angeles Times,<\/i> Furtherfield.org, <i>Reno News and Review<\/i> and the <i>OC Weekly.<\/i>"},{"name":"Micha Cardenas \/ Azdel Slade","bio":"(http:\/\/transreal.org) is an artist\/theorist whose transreal work mixes physical and networked spaces in order to explore emerging forms of queer relationality, biopolitics and DIY horizontal knowledge production. She is a lecturer in the visual arts department at UCSD. She is an artist\/researcher with UCSD Medical Education and the b.a.n.g. lab at Calit2. Her forthcoming publications include 'Becoming Dragon: A Transversal Technology Study' in the book <i>Code Drift<\/i> from CTheory, 'I am Transreal' in <i>Gender Outlaws: The Next Generation<\/i> from Seal Press and <i>Trans Desire<\/i> from Atropos Press. Her current collaboration with Elle Mehrmand, "},{"name":"Pan","bio":"is the founder of Sensory Research, an organization of engineers, designers, and artists dedicated to providing useful tools, services, and ideas to augment human interaction. Most recently, his work has focused on developing interactive software for Android and iPhone, as well as for the P5 virtual reality glove. Sensory Research is also host to the various projects of the Snuggles Collective and the audio archive for the <i>Church of the Subgenius Hour of Slack.<\/i> Pan is the creator and host of the long running technology radio show <i>Interactive Technologies.<\/i> Under the moniker Paradox Explorer, Pan (and associates) organize live performances that incorporate music, video, and interactive technology. He has been participating in technology and culture jamming in various forms since the 1980s."},{"name":"Ryan O'Horo","bio":"is a security consultant with a large professional services company and has designed several car PCs and runs the DIY group Make:NYC."},{"name":"TradeMark G.","bio":"is a musician and artist, perhaps best known as founder of the band The Evolution Control Committee in 1986. He is also a culture jammer, equipment designer, software designer, and organizer. The Evolution Control Committee is best known for its copyright-challenging stance, using found sounds to create new musical works at the risk of copyright violation. This made the ECC the target of a cease and desist order from CBS for sampling newscaster Dan Rather, but also earned them credit for creating the 'mash-up' genre of music (also called bastard pop). TradeMark can take credit for those and all other ECC projects, including the development and construction of the Thimbletron, a live sampling performance instrument that utilizes hand gestures."}]},{"id":"104","title":"T+40: The Three Greatest Hacks of Apollo","description":"Forty years ago, manned exploration of the moon was in full swing. The three greatest hacks of the Apollo program occurred on Apollo 12, 13, and 14, in two cases saving the mission, and in one case saving lives. Drawing on personal interviews with the engineers involved and archival records, this talk will look at the technical aspects of each hack, including largely overlooked, but critical, details of how the lunar module was prepared for lifeboat mode during the Apollo 13 crisis.","timestamp":"1279360800","location":"Lovelace","speakers":[{"name":"Stephen Cass","bio":"was born and raised in Dublin, but now hails from Boston. He cut his programming teeth on a TI 99-4\/A and a totally pimped out BBC Model B+, back when 32 kB of memory was a big deal. Currently a senior editor for <i>Technology Review,<\/i> published by MIT, he has spent a decade covering space for <i>IEEE Spectrum and Discover Magazine<\/i> and currently edits <i>Technology Review's<\/i> Delta-V blog on space technology."}]},{"id":"42","title":"False Domain Name Billing and Other Scams","description":"Telex directories have moved on. In ancient history (the 1970s), scammers would send \"invoices\" to companies listed in the telex directory, billing them for listings in <i>their<\/i> \"telex directory.\" Fax machines were killing telex, and e-mail and FTP provided the death knell. Now those people are showing up again, sending out invoices for \"domain name services.\" They are not invoices, and you don't have to pay them. A look at some of the more infamous scams of technology that people have been taken in by.","timestamp":"1279360800","location":"Bell","speakers":[{"name":"The Cheshire Catalyst","bio":"(Richard Cheshire) is the former publisher of the notorious <i>TAP Newsletter<\/i> of the radical 1970s and 80s. He has also attended (and volunteered at) every HOPE Conference we've ever held."}]},{"id":"63","title":"How to Run an Open Source Hardware Company","description":"In this session, open source hardware pioneers Limor \"Ladyada\" Fried of Adafruit Industries and Phillip Torrone of <i>MAKE Magazine<\/i> show how anyone can start their own open source hardware business. The talk will show how Adafruit runs its open hardware business, top to bottom - from choosing a PCB (printed circuit board) manufacturer to selecting which open source online shopping cart works best for selling electronics online. Limor and Phil will also give a detailed overview of the top ten open source hardware businesses, what they do, and what you can learn from their projects and products. If you're considering turning your electronics hobby into a full-fledged business, this is a talk not to miss.","timestamp":"1279360800","location":"Tesla","speakers":[{"name":"Limor 'Ladyada' Fried","bio":"is founder of Adafruit Industries and recipient of the EFF Pioneer Award for her work in open source hardware."},{"name":"Phillip Torrone","bio":"is senior editor of <i>MAKE Magazine,<\/i> contributing editor to <i>Popular Science<\/i> and founder of <i>Hack-a-Day.<\/i>"}]},{"id":"109","title":"Video Surveillance, Society, and Your Face","description":"Video surveillance is pretty simple. Point a camera at something, watch the stream. But the technology has been integrating into our daily lives. From Makeababy websites, to “change your race” kiosks, facial recognition and the technology spawned from video surveillance is creeping into our lives. The police have taken notice of this, and are starting to interpret laws that make it difficult to photograph them legally. Do these technologies and laws imperil your privacy, your rights as a photographer, or even your life? This is a talk about where these technologies are going, how to stay out of jail, and how to keep your face out of official databases.","timestamp":"1279364400","location":"Tesla","speakers":[{"name":"Joshua Marpet","bio":"has served as an adjunct professor of computer science at St. John's University's Tobin College of Business. Prior to WhiteHat Security (his present employer), he worked as an information security consultant focused on penetration testing, auditing, and forensics. Early in his career, he worked in law enforcement. He was later able to combine those skills with his interest in technology to create security systems for the airline, prison, and gaming industries."}]},{"id":"56","title":"Hacking Out a Graphic Novel","description":"Having a completely different perception of hacking, cartoonist Ed Piskor discovered <i>Off The Hook, 2600 Magazine,<\/i> and many other sources related to the history of the scene. Feeling a strong link between the minds of many cartoonists and the hackers he was reading about, he has decided to create a comic book merging these two interests. Piskor will be talking about his creative process, the reaction that he has received within the community, and the experience of self-publishing this effort, aided by visuals from the books.\"","timestamp":"1279364400","location":"Bell","speakers":[{"name":"Ed Piskor","bio":"is a cartoonist from Pittsburgh working on many projects such as <i>American Splendor<\/i> with writer Harvey Pekar. Aside from wrapping up the Wizzywig comic, Ed is also helping design a soon to be released animation project."}]},{"id":"19","title":"Behind the Padlock: HTTPS Ubiquitous and Fragile","description":"HTTPS is finally getting adopted all over the place - including Gmail, Twitter, Facebook, Google Search, and Wikipedia - as people realize that packet sniffing is easy and credit cards aren't the only sensitive information we send over the Internet. At the same time, a new series of attacks and scandals have shown that TLS is rather fragile. SSL stripping lets attackers bypass sites' HTTPS-only policies; a series of scandals over the past two years has renewed skepticism of certificate authorities' role and the security of the global public-key infrastructure. More and more people are wondering who those strange organizations are, what they're doing in our browsers, whether anyone knows if they're doing a good job, and even how to pronounce some of their names. And recent evidence suggests some CAs may be inept - or cooperating with national governments.\"\r\nSeth will explain the push to increase HTTPS deployment to protect privacy and fight Internet censorship, but also make its protections more meaningful and robust. He’ll describe the work on Firefox plugins that change the browser security model, and ideas on information sources that can supplement the certificate authorities. The talk will also include a look at SSL Observatory, which aims to collect data to catch rogue CAs in the act.","timestamp":"1279364400","location":"Lovelace","speakers":[{"name":"Seth Schoen","bio":"is a senior staff technologist at the Electronic Frontier Foundation. He has worked at EFF for eight years, helping other technologists to understand the civil liberties implications of their work, the EFF staff to better understand the underlying technology related to EFF's legal work, and the public to understand what the technology products they use really do. He helped create the LNX-BBC live CD and has researched phenomena including laser printer forensic tracking codes, ISP packet spoofing, and key recovery from computer RAM after a computer has been turned off. He is secretary of the Noisebridge hackerspace."}]},{"id":"110","title":"Vintage Computing","description":"Many people believe Silicon Valley is where the most significant early developments in computers occurred. But the New York\/New Jersey\/Pennsylvania area was home to many major developments in microcomputer history. See and hear amazing historical and technical achievements of the computing pioneers of our region in the context of how we use computers today. Presenters will also present a comprehensive working exhibit of several early microcomputers all day Saturday.","timestamp":"1279368000","location":"Lovelace","speakers":[{"name":"Bill Degnan","bio":"is vice president of MARCH (Mid-Atlantic Retro Computing Hobbyists) and teaches computer history at the University of Delaware."},{"name":"Evan Koblentz","bio":"is curator of the InfoAge Science Center's Vintage Computer Museum in Wall, New Jersey, founder and president of MARCH (Mid-Atlantic Retro Computing Hobbyists), and is a frequent speaker and author on computer history subjects."}]},{"id":"43","title":"For Its Own Sake and to Build Something Better: A Primer on Neuroscience, Bat Echolocation, and Hacker Bio-inspiration","description":"This talk will introduce bat echolocation, in both behavioral and neuroscientific contexts, demonstrate relevance to engineered (sonar) systems, and provide a description of and results from Scott’s effort to study spatial aspects of bat sonar beams. There will also be an outline of ideas for improving ultrasound range finders (e.g., as common in robotics) and time for discussion.","timestamp":"1279368000","location":"Bell","speakers":[{"name":"Scott Livingston","bio":"currently studies flight, target-tracking, and call adaptation in the echolocating bat Eptesicus fuscus at the University of Maryland. He has begun researching theoretical and computational models of the (primate) vision system in a lab at Caltech."}]},{"id":"50","title":"Grand Theft Lazlow - How Hacking is Both the Death and Future of Traditional and Interactive Publishing, Journalism, and the Media","description":"Writer, producer and director Lazlow, who has worked on titles such as <i>Grand Theft Auto<\/i> and <i>Red Dead Redemption,<\/i> discusses how the war for net neutrality will be lost. This talk will touch on how the battle between content creators and consumers is threatening journalism and democracy, and discuss the threats that both small publishers like <i>2600 Magazine<\/i> and large interactive companies face in an online media landscape that expects everything for free.","timestamp":"1279368000","location":"Tesla","speakers":[{"name":"Lazlow","bio":"is a writer\/director\/producer who has worked in radio, TV, and video games. His first HOPE conference was Beyond HOPE in 1997. As a syndicated tech journalist, he was heard on over 100 radio stations worldwide on <i>The Technofile,<\/i> which was inducted into the Museum of Television and Radio. As a print journalist, he was a contributing writer to several publications including <i>Playboy.<\/i> Currently he works for Rockstar Games on multiple titles, including the <i>Grand Theft Auto<\/i> series as well as this year"}]},{"id":"72","title":"Keynote Address","description":" ","timestamp":"1279371600","location":"Tesla","speakers":[{"name":"Julian Assange","bio":"of Wikileaks is one of our keynote speakers at The Next HOPE. Over the years, and particularly within the past few months, Julian has demonstrated some of the key values of those in the hacker and journalist community who strive to get real information out of the hands of bureaucracy and coverups and share it with the rest of the world, all the while protecting the sources. He has been on the front page of newspapers worldwide with the revelation by Wikileaks of a videotape showing a U.S. Army Apache helicopter attack in Baghdad that killed a dozen people, including two Reuters news staff. Previous attempts at uncovering the tape through the government had failed and its release clearly showed that there was no active firefight between U.S. forces and those killed, as had been maintained in official statements.<br \/>More recently, he has appeared on 'Off The Hook' and 'The Colbert Report' as well as in just about every newspaper in the world. In addition, Julian has been active in the recently announced project to help make Iceland a journalism haven.<br \/>Even <i>more<\/i> recently, Julian has been at the center of a huge controversy involving the alleged disclosure of this leaker"}]},{"id":"83","title":"No Free Lunch: Privacy Risks and Issues in Online Gaming","description":"Online gaming has been growing significantly over the past ten years. There are currently an estimated 1.5 billion unique registered accounts of online games worldwide. However, few people are aware of the risks associated with playing online games. The risks are also not limited to users in their own homes on their own personal computers. Many of these games are being played in the workplace, opening up a whole different set of risks. This research is an initial look at three popular online games - and the potential risks they pose. This initial work was broken into three tasks: analyze the posted privacy policy, terms of use\/service, and other related documents of each game; install the game and analyze system changes; and monitor firewall traffic of game-related processes, especially when we are not even using the particular game.","timestamp":"1279375200","location":"Bell","speakers":[{"name":"Don Tobin","bio":"is currently an assistant professor of computer science and a retired Air Force officer. His research interests are in general computer security, rootkits and detection, social computing, and static and dynamic analysis. He has been breaking rules since the first Pong game came home."},{"name":"Lyndsey Brown","bio":"is an undergraduate student studying computer science. This is her first research experience, and she is amazed at what really happens to your computer when you install even 'friendly' software. She is hooked now, and can't wait to learn more."}]},{"id":"90","title":"A Red Team Exercise","description":"Shall we play a game? This talk will focus on full scope security assessments and stealing intellectual property in five easy steps. It will take the form of a game that divides the audience into attack and defend teams for a builder vs. breaker educational workshop. Included in the discussion will be physical, electronic (network, application, wireless, telecom, and cellular), and intelligence gathering techniques used for offensive projects.","timestamp":"1279375200","location":"Lovelace","speakers":[{"name":"Tom Brennan","bio":"cofounded a niche critical infrastructure services provider that offered protection of U.S. critical infrastructures with red-team services. He has led teams by example since serving with the United States Marines during the first Gulf War. Brennan has over a decade of hands-on experience in information security, as well as industry accreditations such as the Certified Information Systems Security Professional (CISSP), National Security Agency clearance, INFOSEC Assessment Methodology (NSA-IAM), Certified Ethical Hacker (C|EH), and ISACA Certified Information Security Manager (CISM). In 2007, Brennan was appointed by his peers to the global board of directors of the Open Web Application Security Project (OWASP) Foundation (http:\/\/www.owasp.org) as a guide for over 21,000 individuals across 160 chapters worldwide. Additionally, he serves as president of the 1100-member OWASP New York\/New Jersey chapter, which he founded in 2004 after his tenure with the FBI Infragard program."}]},{"id":"62","title":"How to Bring Your Project from Idea to Reality: Make a Living Doing What You Love","description":"Mitch has brought his personal pet projects (including TV-B-Gone universal remote controls) from idea to reality, and is fortunate to make a living doing what he loves. Mitch will outline the practical steps he took to bring his projects from a mere idea, through the steps of research, development, manufacture, sales and distribution, leading, finally, to collecting checks while in the comfort of his home (and while traveling the world). This talk will also show some of the pitfalls of running one's own business.","timestamp":"1279378800","location":"Tesla","speakers":[{"name":"Mitch Altman","bio":"is the brains behind Cornfield Electronics, and one of the cofounders of the Noisebridge hackerspace in San Francisco. Mitch is best known as the inventor of TV-B-Gone, but his list of hacks and cool electronics includes a lot of other intriguing projects. When he is not at Noisebridge making and teaching, he is on the road from hackerspace to Hacker-Con and back again, sharing his love of electronics."}]},{"id":"78","title":"Modern CrimeWare Tools and Techniques: An Analysis of Underground Resources","description":"This talk will highlight the features, functions, availability, and impact of modern crimeware tools. The talk will have a specific focus on the Zeus payload and command\/control application, and will touch upon other leading banking malware. In addition to detailed technical information, the talk will highlight the history and evolution of this particular trojan and the underground economy that drives it. Furthermore, there will be discussion of other tools that are often used in conjunction with the payload, such as remote exploit kits. The talk will also highlight mitigation techniques and basic design principles for web applications and server configurations that can help reduce the impact of crimeware on individuals and organizations.","timestamp":"1279378800","location":"Bell","speakers":[{"name":"Alexander Heid","bio":"is an information security researcher from Miami. He is a founding member of HackMiami, a hackerspace in south Florida, and is also a board member for the south Florida OWASP organization. Alexander was quoted by <i>Technology Review Magazine<\/i> in February 2010 regarding research on the Zeus trojan and antivirus evasion techniques. He is currently employed as a vulnerability analyst for a Fortune 20 financial firm."}]},{"id":"47","title":"Geo-Tagging: Opting-In to Total Surveillance","description":"Many social networks allow users to expose geo-locational data. For example, Twitter allows each tweet to be tagged with the GPS location of the user. While perhaps harmless individually, once aggregated, these geo-tagged tweets can be used to build a profile of the user, revealing far more personal information than intended. A tool that aggregates tweets and helps visualize and classify where people are tweeting from will be demonstrated and the implications discussed.","timestamp":"1279378800","location":"Lovelace","speakers":[{"name":"Paul V","bio":"is a grad student in Toronto trying to figure out why people geo-tag tweets, what they get out of it, and what the risks are."}]},{"id":"103","title":"Surf’s Up! Exploring Cross Site Request Forgery (CSRF) through Social Network Exploitation","description":"Web application security has progressed by leaps and bounds since first being discussed in the early 8:00 pms. XSS, SQLi, Directory Traversals, and other traditional attacks are becoming more widely understood by a greater demographic of developers. Unfortunately, we are just scratching the surface. There still exists a great number of attack vectors that are ignored. Cross Site Request Forgery is a prime example of this. It is a simple technique with powerful implications ranging from denial of service and firewall bypass to full blown site compromise.\r\nThe theory of CSRF will be presented here in simple to understand terms. An example of a virulent exploit of a real world social networking site (Vampirefreaks.com) using CSRF will also be shown.","timestamp":"1279382400","location":"Bell","speakers":[{"name":"Daniel McCarney","bio":"is a bizarre combination of stereotypes, backgrounds, and interests ranging from counter culture to artificial intelligence. Interested in a career of lifelong learning, Daniel considers knowledge a weapon and aims to arm you and himself."}]},{"id":"98","title":"Snatch Those Waves: Prometheus Radio and the Fight for Popular Communications","description":"The Prometheus Radio Project started with radio pirates fighting for local groups to be able to run community radio stations, and over the years has sued the FCC to stop media consolidation, built stations in places like Venezuela and Tanzania, and experimented with using off the shelf wireless technologies to do for hundreds of dollars what commercial stations spend tens of thousands for. This panel will help bring you up to date on the political debates in Washington about low power FM, open spectrum, and IBOC digital radio. They will talk about epic radio barnraisings where hundreds of people are brought together to build a new radio station over the course of a single weekend - and their plan for the next barnraising in the Hudson Valley.","timestamp":"1279382400","location":"Tesla","speakers":[{"name":"Maggie Avener","bio":"is the technical and training organizer at the Prometheus Radio Project. She spends her days giving technical advice to community radio stations, teaching workshops to up-and-coming radio geeks, and brainstorming on how participatory media can take over the world."},{"name":"Pete Tridish","bio":"is a cofounder of the Prometheus Radio Project. His focus for Prometheus is radio engineering and policy advocacy. He has been a carpenter, an environmental educator, a solar energy system installer, a squatter, a homeless shelter volunteer, and an activist in many social movements since the age of 16."}]},{"id":"77","title":"Memory Fun 101 - Memory Training for Everyone","description":"A powerful memory can be an invaluable asset in life. Memory is absolutely fundamental to learning, so improving one's memory can have a profound positive impact on both academic and job performance. This seminar will entertain and educate attendees, while helping them to develop valuable memory skills that will enrich their lives.\r\nIn this fun and entertaining program, 2008 USA National Memory Champion Chester Santos will teach attendees the basics of memory improvement. Attendees will learn a number of memory boosting methods that will exercise their imagination and awaken their creativity. Participants will be shown how to utilize both sides of their brain in order to make information stick and become unforgettable. Attendees will participate in enjoyable exercises and will actually be able to feel their memory ability improving throughout the seminar. Everyone will leave this seminar with sharper minds and a solid foundation in exercises and techniques that will benefit them throughout their lives. Talk about providing HOPE!","timestamp":"1279382400","location":"Lovelace","speakers":[{"name":"Chester Santos","bio":"is the 2008 United States National Memory Champion. He is one of the nation's foremost experts on memory improvement and has appeared in <i>The New York Times, Wall Street Journal, San Francisco Chronicle, Washington Post, USA Today,<\/i> CNN, and various other television, radio, and printed media all over the world. Chester holds an undergraduate degree in psychology from the University of California at Berkeley, and a master's degree in software engineering from Golden Gate University. He draws on his degree in psychology, his vast experience competing at the highest levels of competitive memory, and the latest developments in brain research in order to help people from all over the world to realize the extraordinary power of their minds."}]},{"id":"97","title":"Smartphone Ownage: The State of Mobile Botnets and Rootkits","description":"Symbian Botnet? Mobile Linux Rootkits? iPhone Botnets? Millions of phones at risk? The press coverage on smart phone threats is at times somewhat accurate, distant, and occasionally (if unintentionally) misleading. They tend to raise questions such as: How close to PC levels (100,000+ to millions of nodes) have mobile botnets reached? Have mobile rootkits reached the complexity of those on the PC?\r\nThis talk will cover the state of rootkits and botnets on smart phones from the perspective of anti-malware researchers, including demystification of the threat from mobile rootkits and mobile botnets, the differences (if any) between mobile rootkits and mobile botnets vs. their PC counterparts, and a look at how samples seen in the wild and researcher PoCs function.","timestamp":"1279386000","location":"Lovelace","speakers":[{"name":"Jimmy Shah","bio":"is a mobile anti-virus researcher for McAfee, specializing in analysis of mobile threats on existing platforms (J2ME, SymbOS, Windows Mobile, iPhone OS, Android) and potential mobile malware and spyware. He works with a team of researchers that regularly provides analysis and research on mobile threats to McAfee clients."}]},{"id":"86","title":"Privacy is Dead - Get Over It (3 hours)","description":"This will be a wide-ranging lecture covering databases, privacy, and \"computer-aided investigation.\" This talk will include numerous examples of investigative online resources and databases, and will include an in-depth demonstration of an actual online investigation done on a volunteer subject. Emphasis will be placed on discussing the \"digital footprints\" that we all leave in our daily lives, and how it is now possible for an investigator (or government agent) to determine a person's likes and dislikes, religion, political beliefs, sexual orientation, habits, hobbies, friends, family, finances, health, and even the person's actual physical whereabouts, solely by the use of online data and related activity. The final half hour of the talk will be devoted to Q&A.","timestamp":"1279386000","location":"Tesla","speakers":[{"name":"Steven Rambam","bio":"is the founder and CEO of Pallorium, Inc. (http:\/\/www.pallorium.com), a licensed investigative agency with offices and affiliates worldwide. Recently described by a New York newspaper as 'legendary,' during the past 25 years he has closed more than 10,000 investigations including 500 homicide and 'death claim' cases. Steven is perhaps best known for his pro bono activities, which have included the investigation of nearly 200 Nazi war criminals in the USA, Canada, Europe, and Australia. He has also coordinated efforts to expose terrorist groups' fundraising activities in the United States and has coordinated investigations which resulted in the tightening of airport security in eight U.S. cities prior to 9\/11. Many of his investigations involve coordination with national authorities, and he has received commendations and awards in a number of foreign locations and mention on the floors of the Canadian and Israeli Parliaments. Steven has appeared at every HOPE conference, and his 'Privacy Is Dead - Get Over It' presentation has received international acclaim."}]},{"id":"80","title":"Much Ado About Randomness","description":"Access to random bits is required by almost every security protocol. A common assumption in cryptography is that all parties have access to a perfect random source. Then we can prove that signatures are unforgeable, SSL is secure, and life is good. In practice, the situation is quite different as demonstrated by recent exploits of Debian OpenSSL library, WEP, and Netscape 1.1 keys. This talk will try to bridge the gap between theory and practice. The discussion will include what it means for a number to be \"random\" and demonstrate how some open source tools, as well as custom tools, can be used to find programs with poor sources of randomness.","timestamp":"1279386000","location":"Bell","speakers":[{"name":"Dr. Aleksandr Yampolskiy","bio":"is a head of security and compliance at a well-known e-commerce company. Prior to this position, he has been a lead technologist for authentication\/authorization and IDM products in several Fortune 100 companies. He's been cited in <i>The New York Times,<\/i> <i>Yale Scientific,<\/i> and published half a dozen articles in top security conferences. Hers been hacking programs for as long as he can remember. He has a B.A. in mathematics from NYU, and a Ph.D. in cryptography from Yale."}]},{"id":"44","title":"Free Software: Why We Need a Big Tent","description":"There's been a lot of talk about diversity in free software lately. This talk will cover why that's important and introduce some of the tactics from the political organizing world that can be used to build a successful free software project and by extension a successful free software movement. Expect references to Saul Alinksy and Cesar Chavez as well as a bit of an introduction to free software and what it means for our increasingly technology-dependent world.","timestamp":"1279389600","location":"Lovelace","speakers":[{"name":"Deb Nicholson","bio":"has been working at the Free Software Foundation for four years. Before that, she spent 13 years working for equality and social justice by pushing legislation and supporting progressive candidates. As our society becomes more dependent on digital methods for access to power and information, she is glad to be part of the struggle towards freedom for computer users."}]},{"id":"111","title":"Why You Should Be an Amateur","description":"Lots of people think the “maker culture” is a relatively new phenomenon. However, one group has been doing it for close to 100 years: amateur radio operators. While some dismiss amateur radio as an aging artifact from decades ago, today's radio amateurs are putting together wide area wireless networks, developing digital protocols that use the tiniest amount of bandwidth, and building radios from scratch. This presentation will review the basics of amateur radio, the advantages over unlicensed devices, and areas of interest you can apply to your existing projects.","timestamp":"1279389600","location":"Bell","speakers":[{"name":"Ben Jackson","bio":"is just another geek from Massachusetts. He spends his days doing InfoSec stuff, generally breaking things, and being relentlessly yet constructively paranoid for a large public sector organization in southern New England. In his spare time, he enjoys being a husband and dad, messing around with computers, VoIP, analog telephones, amateur radio, doing research as part of Mayhemic Labs, and generally pressing anything with a button on it. Ben was the lead author for <i>Asterisk Hacking<\/i> from Syngress Publishing, former host of <i>Binary Revolution Radio,<\/i> has spoken at Defcon, HOPE, Source Boston, QuahogCon, and various other conferences and strongly dislikes writing about himself in the third person."}]},{"id":"89","title":"Reach Out And Touch Face: A Rant About Failing","description":"Hackers love knowledge. They try to find out how stuff works. And that's great. Experimentation is a major part of hacking. It is in the most philosophical sense a deconstruction of things.\"\r\n\"A specific use is never inherent to an object, even though technical demagogues like to claim that it is. Just compare the term \"self-explanatory\" and the term \"archeological find.\" It's a pretty hard task to find out what technology is and what it should do if you don't have a clue about the context. Usually the use is connected with the object through definition (\"instructions for use\"). Turning an object against the use inscribed in it means probing its possibilities.\r\nScience and Technology Studies (especially Langdon Winner and Bruno Latour) have convincingly demonstrated that the widespread inability to understand technological artifacts as fabricated entities, as social and cultural phenomena, derives from the fact that in retrospect only those technologies that prove functional for a culture and can be integrated into everyday life are \"left over.\" However, the perception of what is functional, successful, and useful is itself the product of social and cultural, and, last but not least, political and economic processes. Selection processes and abandoned products (developmental derailments, sobering intermediary results, useless prototypes) are not discussed.\r\nWell. What can we do?\r\nWe can <i>fail.<\/i> Beautifully.","timestamp":"1279393200","location":"Lovelace","speakers":[{"name":"Johannes Grenzfurthner","bio":"is an artist, writer, curator, and director. He is the founder of monochrom, an internationally acting art and theory group. He holds a professorship for art theory and art practice at the University of Applied Sciences in Graz, Austria. He is head of the 'Arse Elektronika' festival in San Francisco, host of 'Roboexotica' (Festival for Cocktail-Robotics, Vienna and San Francisco), and curates the Paraflows Conference inVienna. Recurring topics in Johannes' artistic and textual work are contemporary art, activism, performance, humor, philosophy, postmodernism, media theory, cultural studies, sex tech, popular culture studies, science fiction, and the debate about copyright."}]},{"id":"51","title":"Hackers for Human Rights","description":"There are tremendous humanitarian and human rights problems throughout the world today. While technology is generally seen as a force for good, plenty of closed societies have used technology to clamp down on their citizens and stifle human rights. Already the fight over Internet freedom and data security has cost the lives or liberties of dissidents in countries like Iran, China, Vietnam, and Russia. Citizens have been sentenced to long jail terms and hard labor for a critical blog posting, or accessing foreign news sites. Creative technological efforts can combat oppressive forces, protect dissidents, journalists, and activists, and save lives. There are some really exciting ways folks with all sorts of talents can get involved in the global effort for human rights and humanitarian improvement. Come hear about some of the efforts that seek to help the oppressed worldwide, and how you can help.","timestamp":"1279393200","location":"Bell","speakers":[{"name":"Adrian Hong","bio":"currently serves as director of the Pegasus Project, an initiative that uses cutting edge technology to penetrate closed societies and empower people in those nations to communicate amongst themselves, and with the outside world. In December of 2006, he was arrested in the People's Republic of China and imprisoned before being released and deported for sheltering and moving North Korean refugees sought by the Chinese and North Korean governments. He was a visiting lecturer in 2008, teaching 'America, Human Rights, and Foreign Policy' at Korea's Ewha University, and he is a TED Senior Fellow."}]},{"id":"105","title":"The Telephone Pioneers of America","description":"The Telephone Pioneers of America is an organization of mostly retired employees of the Bell System and affiliated companies. They remain active in the community as an organization that promotes their history and industry. You can find them in many communities across the nation, often in the very cities and neighborhoods they spent their careers working in. The pioneers have amassed lifetimes of wisdom working on the telephone system and intimately understand the technology and politics of it. The telephone company will never be what it was when they were employed there and they know that the next generation of pioneers may not ever actually work for \"the company\" as they did.\r\nUsing photographs, recordings, and artifacts, this unique treasure will become accessible to members of the audience, especially younger individuals who may not ever have used what is now vintage telephone equipment - like rotary dial phones. There will be a selection of functional and historically significant equipment for attendees to learn about and enjoy thoroughly. This talk is intended to help bridge the gap between hacker and pioneer.","timestamp":"1279396800","location":"Bell","speakers":[{"name":"Kyle Drosdick","bio":"is an independent publisher, consultant, and photographer. He volunteers with organizations he is interested in, like The Telephone Pioneers of America, The Photographic Center, Lance Armstrong Foundation, HackerBot Labs, and, more recently, Sensible Washington. The Telephone Pioneers are an example of how that work impacts and supports his thriving adult learning process."}]},{"id":"60","title":"Hey, Don't Call That Guy A Noob: Toward a More Welcoming Hacker Community","description":"The hacker community strives to develop and exchange cutting-edge ideas. A key component of achieving that goal is continuing to involve new people in the community, since they can add fresh perspectives from which to view all types of hacking. However, either because of the perception of the hacker community as something secretive or nervousness about interacting with people who are supposedly more knowledgeable, it can be a daunting experience for someone new to not only get involved, but also to want to remain involved in the community. This talk aims to make people in the hacker community aware of the concerns that people new to it face, and provide concrete steps for building a culture of making new people feel welcomed and valuable.","timestamp":"1279396800","location":"Lovelace","speakers":[{"name":"Nicolle ('Rogueclown') Neulist","bio":"is a founding member of Pumping Station: One, the hackerspace in Chicago. She first encountered the hacker community in the spring of 2008, and her first hacker conference was The Last HOPE. She's dedicating her talk to all of the fascinating, brilliant, and welcoming people that she has met since then who have helped her realize that the hacker community is home, and who have taught her everything she has learned in the last two years."}]},{"id":"92","title":"Rummaging in the Government's Attic: Lessons Learned from More Than 1,000 Freedom of Information Act Requests","description":"Phil and Michael will conduct a guided tour through GovernmentAttic.org, a website that has (legally!) obtained and published hundreds of interesting government documents obtained via the Freedom of Information Act (FOIA). Based on extensive interviews with the site’s creators and through a half dozen examples they will describe some of the clever FOIA tools and techniques (hacks, in other words) that the site has employed to obtain informative, valuable, and sometimes even amusing documents and datasets from government agencies. They will also highlight similarities between the mindsets and approaches of hackers and successful FOIA requesters.","timestamp":"1279396800","location":"Tesla","speakers":[{"name":"Michael Ravnitzky","bio":"has worked as an investigative reporter, private investigator, trade association technical director, aeronautical engineer, and now serves as an attorney in the communications field. As a journalist, he broke new ground by using the Freedom of Information Act in innovative ways (having personally filed some 10,000 FOIA requests since 1992), and he continues to encourage reporters to apply these techniques to spur greater government transparency, openness, and utility. He has written a number of technical articles, the most recent being a proposal to mount mobile sensors on the national postal vehicle fleet to collect data and map parameters such as weather, pollutants, potholes, areas of weak radio signals, and perhaps even to raise alerts about chemical or biological agents. He received a B.A. in Physics from Cornell University and a law degree from William Mitchell College of Law."},{"name":"Phil Lapsley","bio":"has spent the last several years documenting the history of phone phreaking, through hundreds of interviews and Freedom of Information Act requests. He has been interviewed by National Public Radio and the BBC and quoted in multiple newspapers, including <i>The New York Times,<\/i> on the topic. He has also presented on phone phreaking history at the 10th Annual Vintage Computer Festival and The Last HOPE. When not researching phreaking, Phil has tried to act like an upstanding member of society. He cofounded two high technology companies in the San Francisco Bay Area and worked for McKinsey and Company, a management consulting company that advises Fortune 100 companies on business strategy. He holds B.S. and M.S. degrees in electrical engineering and computer sciences from U.C. Berkeley and an MBA from the MIT Sloan School of Management. He codeveloped Network News Transfer Protocol (NNTP, RFC 977) used in the USENET news system. He is also the author of one textbook, 17 patents, and numerous technical articles."}]},{"id":"28","title":"Circuitbending","description":"A general overview of circuit bending, as well as its history, and some examples of really cool bends. An assortment of bent toys will be displayed. This talk will cover a good deal on the basics of bending, and some of the techniques used to coax the sounds out of a variety of toys. You’ll learn what to look for in bendable toys, as well as techniques that are least likely to destroy toys. There will also be a basic workshop on circuit bending where people can build their own bent toy.","timestamp":"1279400400","location":"Lovelace","speakers":[{"name":"Jimmie Rodgers","bio":"is a circuit bender and electronic instrument creator."}]},{"id":"100","title":"Social Engineering","description":"People have been known to come to HOPE just for this panel, in which the history, stories, and demonstrations of social engineering are laid out for all to see - and hear. Something will invariably be revealed over the telephone by someone who really should know better in our traditional live demonstration that never fails to entertain.","timestamp":"1279400400","location":"Tesla","speakers":[{"name":"Emmanuel Goldstein","bio":"came up with the idea for HOPE conferences in 1994 after growing tired of constantly having to visit his friends from around the world. By having all of them show up at the same time over a single weekend every couple of years under the guise of attending a trendy conference, he was able to find the time to watch every episode of <i>Dr. Who<\/i> in order, pursue a career as a public nuisance, and come up with the idea for Windows 7. (Lawsuits are scheduled for the fall.) When not trying to define his life in a paragraph, he publishes <i>2600 Magazine,<\/i> hosts radio shows <i>Off The Hook<\/i> and <i>Off The Wall,<\/i> and spends a few hours a day trying to think of a clever name for the next HOPE conference (not this one), which won"}]},{"id":"15","title":"2600 Meetings: Yesterday, Today, and Tomorrow","description":"In this panel, longtime attendees and website admins of New York City's <i>2600<\/i> meeting will explain how an event that began in the 1980s as a simple way for local hackers to meet each other in person has grown into a major and vital part of the worldwide hacker community. The panel will recap the history of <i>2600<\/i> meetings, and explain the basics for those interested in getting involved with an existing meeting or starting a new one. Issues involved in operating a <i>2600<\/i> meeting's web presence will also be addressed. There will most certainly be a recounting of some favorite meeting stories and experiences, and the lasting effects the meetings have had on all sorts of lives.","timestamp":"1279404000","location":"Lovelace","speakers":[{"name":"Gonzo","bio":"is an urban explorer, veteran hacker, and regular at the New York City 2600 meetings. His site is http:\/\/reprimandmag.com, and he lives in New Jersey."},{"name":"Grey Frequency","bio":"is an artist, co-admin of NYC2600.net and addicted to pretty things that have blinking lights. You might know her from her artwork here or as the girl that married a Canadian she met at HOPE."},{"name":"Rob T Firefly","bio":"is an artist, writer, nerd-of-all-trades, and co-admin of NYC2600.net. You might know him from his work on <i>Off The Hook,<\/i> his misadventures with the Phone Losers of America, his artwork here at HOPE, or those prank calls he makes to your home at inconvenient hours. Rob lives at robvincent.net."}]},{"id":"24","title":"Building and Breaking the Next HOPE Badge","description":"This lecture describes the design of The Next HOPE badge's hardware and firmware, as well as the security of the same. Attendees will learn how to add a USB chip, how to reflash a badge with new firmware, and how to write new software for the device. Additionally, attacks against which the badge is - or is not - defended will be explored in detail. Topics will include the design of the Open Beacon firmware, forced firmware extraction, and the repurposing of badges into packet sniffers, radio jammers, Morse code beacons, and a dozen other things.","timestamp":"1279404000","location":"Tesla","speakers":[{"name":"Travis Goodspeed","bio":"is a belt buckle engineer from southern Appalachia with a hobby of exploiting and reverse engineering embedded systems. Recently, he discovered a PRNG vulnerability of the key exchange protocol used by many ZigBee Smart Energy Profile devices. He is known to carry absurd quantities of GoodFET JTAG debugger boards, giving them out to any and all neighbors."}]},{"id":"87","title":"PSTN-based Cartography","description":"Sun Microsystems use to say, \"The network is the computer.\" This talk will focus on that \"other\" computer. The neglected computer. The PSTN (Public Switched Telephone Network) “computer.” Throwing VoIP into the mix, it's never been easier to \"map\" that neglected \"computer.\" This talk will discuss how to map the \"Human Network\" as well as new techniques in automated PSTN network scanning including more X.25 network goodies. This is the second part of \"Hacking International Networks using VoIP\" from The Last HOPE.","timestamp":"1279404000","location":"Bell","speakers":[{"name":"Da Beave","bio":"(Champ Clark III) is one of the founding members of the VoIP hobbyist group Telephreak. He also co-authored <i>Asterisk Hacking, Threat Analysis 2008,<\/i> and brought the OpenVMS Deathrow Cluster into existence. He is currently employed with Softwink, Inc., which specializes in security monitoring within the financial industry and has authored various security utilities including iWar, tscan\/dscan (X.25), and many others. He calls the 904 NPA home."},{"name":"JFalcon","bio":"has been involved in the scene for almost two decades. He also has the claim to fame of being the first federally convicted computer hacker in the state of Alaska during Operation Sundevil (1991-1995). Since his release in 1996, he has professionally consulted businesses and business executives in their own security needs along with being a senior system administrator to Fortune 500 companies and U.S. government agencies. Currently, he maintains his passion for finding unique solutions to today's problems by studying the past, from running his own hybrid BBS system to see how it could compete with social network websites, to designing his own robotic antenna controls for his radio gear, to studying people's experiments into hydrogen fuels. He currently calls Seattle his home."}]},{"id":"88","title":"Radio Reconnaissance in Penetration Testing - All Your RF Are Belong to Us","description":"Tired of boring old pen tests where the only wireless traffic you see is 802.11 and maybe a little Bluetooth? With this amazing new invention, the radio, your eavesdropping options can be multiplied! Come to this talk to learn techniques for discovering, monitoring, and exploiting a wide array of radio traffic with real world examples illustrating how these techniques have been used to gather information on a target's physical security, personnel, and standard operating procedures.","timestamp":"1279407600","location":"Bell","speakers":[{"name":"Matt Neely","bio":"is the profiling team manager at SecureState, a Cleveland based security consulting company. His research interests include the convergence of physical and logical security, lock and lockpicking, cryptography, and all things wireless. Matt is also a host on the <i>Security Justice<\/i> podcast."}]},{"id":"55","title":"Hacking Our Biochemistry: Pharmacy and the Hacker Perspective","description":"We are complex biochemical machines. With advances in science and medicine, we have taken to pharmaceutically hacking ourselves. Hackers are in a unique position to understand the way we design and use drugs to manipulate disease states and to hack microorganisms that are attempting to hack us. With drugs we send chemical instructions to biological processes to change what they do. How do these instructions work? How can we tweak them? With thought-provoking examples, a pharmacy student shows how the hacker perspective is applied to our biochemistry to improve our quality of life.","timestamp":"1279407600","location":"Lovelace","speakers":[{"name":"Jennifer Ortiz","bio":"is a pharmacy student at Creighton University, PharmD class of 2012. She graduated from Rensselaer Polytechnic Institute with a B.S. in electronic media arts and communication and a minor in computer science. She worked for five years in web development and is now working at a hospital as a pharmacy intern."}]},{"id":"82","title":"Net Wars Over Free Speech, Freedom, and Secrecy or How to Understand the Hacker and Lulz Battle Against the Church of Scientology","description":"Following a brief lecture on Project Chanology, the question will be posed: how can we harness the power of lulzy virality, of pleasure, of trickery, of spectacular trolling for purposes above and beyond sharing the wisdom of Advice Dog? It’ll start with a brief look at great activist media in the past, from Guernica and the picture of the whole Earth to projects by the Yes Men - how they spread ideas and helped people get informed, organize, and act. What makes the creation of lulzy memes different? Learn about how to create exploitable forms and rapid variations, and mechanisms for bringing the best stuff forward. Can we make media memes with goals beyond lulz, and teach activists who've never heard of 4chan to make them too?\r\nPart lecture, part workshop, this will feature cameos by Rageguy, Pablo Picasso, V, alt.pave.the.earth, Kathe Kollwitz, Courage Wolf, Stewart Brand, Sarah Palin, Batman, Goya, Philosoraptor, Adolf Hitler, Trollface, Shepard Fairey, Joseph Ducreux, David Cameron, lots of Spartan warriors, and lots and lots of (trollish) cats.","timestamp":"1279407600","location":"Tesla","speakers":[{"name":"Finn Brunton","bio":"is a postdoctoral researcher in Media, Culture, and Communication at NYU. He works on the history and politics of digital media and is writing a book about spam."},{"name":"Gabriella Coleman","bio":"is an assistant professor in NYU's Department of Media, Culture, and Communication. She specializes in the anthropology of computer hacking and digital activism and is completing a book manuscript 'Coding Freedom: Hacker Pleasure and the Ethics of Free and Open Source Software.'"}]},{"id":"101","title":"Spy Improv on Steroids - Steele Uncensored - Anything Goes","description":"Steele has gotten past the anger and is now offering up icy-cold straight public intelligence in the public interest. A recovering spy, founder of the modern Open Source Intelligence (OSINT) movement, #1 reviewer of nonfiction as rated by readers at Amazon, and now practicing what he preaches deep in the jungles of Central America, Steele, who reads in 98 categories and is down to his last of nine lives, will answer any question on any topic for as long as it takes. The record is four hours. He may die soon, so he wants to try for six hours.","timestamp":"1279411140","location":"Lovelace","speakers":[{"name":"Robert Steele","bio":"is the first public intelligence officer of the 21st Century. A recovering spy who signed the letter against torture and has generally condemned the current and past administrators of the various national intelligence elements in the USA, he has helped 90 countries get a grip on Open Source Intelligence (OSINT), and is today a pioneer of multinational, multifunctional information-sharing and sense-making. He has written a number of books, all of which will be on sale at half price on Saturday only, and is the host of three websites, http:\/\/www.oss.net (original), http:\/\/www.earth-intelligence.net (non-profit), and http:\/\/www.phibetaiota.net (front end for both and the main site for anyone interested in public intelligence of, by, and for the public."}]},{"id":"93","title":"Saturday Night Hacker Cinema","description":"At press time, there were all sorts of rumors flying around about leaked hacker films and other brand new presentations that few have seen. While we can’t say with certainty what we’ll be showing, we most definitely can say that it’ll capture your attention and be a unique window into the wonderful world of hackers.","timestamp":"1279411140","location":"Tesla","speakers":[]},{"id":"57","title":"Hacking Terrorist Networks Logically and Emotionally","description":"This presentation will touch upon broad aspects of forensics, encryption, and social engineering, and how they relate to the tracking of extremists.\r\nHat Trick has over seven years of experience in this very unique field, and has put together one of the world’s largest open source databases of extremist multimedia. Topics covered include common vulnerabilities of extremist sites, the unique behaviors of extremists, how to get terrorist IPs and passwords, and what to do with them when you've got them.\r\nMudsplatter will discuss the psychology of manipulation, and how to gain access to even the most secure networks using simple tricks of social engineering. Topics include how to lie with confidence, getting the paranoid to trust you, using trolling to your advantage, and some of the most common liabilities of social networking.","timestamp":"1279447200","location":"Bell","speakers":[{"name":"Hat Trick","bio":"has built and maintained a dedicated website dealing with obtaining information from terrorist networks. He has worked with information gathering of terrorist networks with http:\/\/www.liveleak.com, National Geographic in providing footage for <i>Reign of Terror - Suicide Web,<\/i> and for government agencies. He now serves as web application security consultant for a Fortune 20 financial institution."},{"name":"Mudsplatter","bio":"has served four years in the U.S. Air Force as a computer, network, crytography, and telephone switching tech. He has also served a year with the NSHC in South Korea, performing research and development as the senior master security engineer and lead security consultant and is currently the acting military liaison for NeoCatena Systems."}]},{"id":"59","title":"Hacking Your GPS","description":"There is more to a GPS than a pleasant voice telling you to turn right on Cedar Street, and showing a color display of adjacent ramps and intersections. This talk will focus on the technical implementation of the current GPS system, and how the user location is derived from precise clocks on satellites. You’ll see how to capture, send, and analyze NMEA data streams exchanged between your computer and GPS. Privacy issues, geocaching, and secret key codes required to manipulate GPS base maps will also be discussed.","timestamp":"1279447200","location":"Lovelace","speakers":[{"name":"Cass Lewart","bio":"is an electrical engineer and a longtime hobbyist\/hacker. He is also the author of many books and articles on database programming, hobby electronic projects, and data communication. Cass and his wife Ruth were joint recipients of the Hobbyist of the Year award from the Amateur Computer Group of New Jersey, the oldest U.S. computer club."}]},{"id":"81","title":"The Need for a Computer Crime Innocence Project","description":"High profile computer forensic cases like those of Julie Amero and Michael Fiola, where innocent people were falsely charged with downloading illegal files, illustrate the need for professional forensic standards for determining whether a user, or malware infecting their computer, downloaded suspect files. Joe Cicero discusses his experiences dealing with his college administration, attorneys, and the EFF over the problematic research issues that willful installation of malware brings about. He will discuss his project outline and testing protocols and procedure, detailing why certain decisions were made. Audience feedback will be requested on how to create an innocence project designed specifically for computer crime cases. Tech-savvy criminal defense attorney Alex Muentz and EFF's Seth Schoen will round out the panel with their insights.","timestamp":"1279447200","location":"Tesla","speakers":[{"name":"Alex Muentz","bio":"is a geek and a lawyer. When he's not trying to keep his clients out of trouble, he teaches about the collision of law and technology and tries to be useful to his fellow geeks."},{"name":"Joe Cicero","bio":"is currently a network specialist instructor for Northeast Wisconsin Technical College and a columnist for the <i>Shawano Leader.<\/i> He specializes in teaching Linux, network security, and computer forensics courses. Joe has had positions covering every aspect of computers including help desk support, technician, programmer, network administrator, directory of technology, computer security and incident response team member, defense forensic examiner, and, of course, instructor."},{"name":"Seth Schoen","bio":"is a senior staff technologist at the Electronic Frontier Foundation. He has worked at EFF for eight years, helping other technologists to understand the civil liberties implications of their work, the EFF staff to better understand the underlying technology related to EFF's legal work, and the public to understand what the technology products they use really do. He helped create the LNX-BBC live CD and has researched phenomena including laser printer forensic tracking codes, ISP packet spoofing, and key recovery from computer RAM after a computer has been turned off. He is secretary of the Noisebridge hackerspace."}]},{"id":"54","title":"Hacking for an Audience: Technology Backstage at Live Shows","description":"Working behind the scenes at live shows, you will find people with titles like Master Electrician, Audio Engineer, Automation Carpenter, or Technical Director. These people won’t likely call themselves hackers, but that’s what they do: take technologies and techniques from larger industries, and appropriate, adapt, and extend them to the high-stakes, high-pressure world of live shows, where the failure of a two dollar part could cause the loss of a show and hundreds of thousands of dollars of ticket revenue. In this industry, every night all over the world, hundreds of technicians with nerves of steel do their best to anticipate the inevitable failures which all hackers encounter, and accommodate them gracefully, preferably in a manner which the audience never even notices. This session will cover who does what on live shows, give an overview of the technologies, and introduce some of the strategies used to ensure that the show goes on.","timestamp":"1279450800","location":"Lovelace","speakers":[{"name":"John Huntington","bio":"is a professor of entertainment technology at New York City College of Technology (Citytech\/CUNY), and a visiting professor at the Yale School of Drama. Huntington's book, <i>Control Systems for Live Entertainment,<\/i> now in its third edition on Focal Press, was the first on the topic of entertainment control and show control, and continues to be the leading book in the field. Huntington freelances as an entertainment and show control systems consultant, author, and sound designer\/engineer, and maintains a blog on entertainment technology (and severe weather) at http:\/\/www.controlgeek.net. He lives in Brooklyn."}]},{"id":"46","title":"From Indymedia to Demand Media: Participation, Surveillance, and the Transformation of Journalism","description":"In the late 1990s, advances in digital content creation and distribution raised hopes that journalism and the media were becoming radically democratized. While these hopes have been borne out to some degree, old hierarchies and fissures are reasserting themselves as new forms of journalism become normalized. What's more, digital technology affords more than just participation; it affords surveillance and algorithmically driven visions of consumption. This conversational talk will address these issues, with a jumping off point being a comparison of different journalistic \"visions of their audience.\"","timestamp":"1279450800","location":"Tesla","speakers":[{"name":"Chris Anderson","bio":"is an assistant professor of media culture at the College of Staten Island and a fellow at Yale Law School and the New America Foundation. He was an organizer and editor with New York City Indymedia from 2001-2008 and helped found the inaugural New York City Grassroots Media Conference in 2004."}]},{"id":"76","title":"Lock Bypass without Lockpicks","description":"You train as hard as you can, picking lock after lock, learning about all the different picks, different picking techniques and styles, anti-picking features, and how to manipulate them... then some guy with a screwdriver takes the hinges off the door faster than you can pick the doorknob. That's right, there are ways to bypass locks which don't involve direct manipulation of the pins, and they not only tend to be easy, but fast. This talk follows the story of Waldo, one hard-to-find hacker trying to wrestle the truth from the jaws of a shady corporation peddling suspicious medication. Waldo, having been captured and stripped of his picks, must escape using only his wits, and whatever he can find on his way out.","timestamp":"1279450800","location":"Bell","speakers":[{"name":"Dan Crowley","bio":"is an independent information security researcher and lecturer with an appreciation for art and its integration with technology. Most of his time is spent playing around with web-based technologies or locks. Dan has previously won the US-TOOOL 'Gringo Warrior' lockpicking competition."}]},{"id":"95","title":"Simpsons Already Did It - Where Do You Think the Name \"Trojan\" Came From Anyway?","description":"SMS blockers, ransomware, licenses for trojans, factory installed malware... every day the news is full of accounts of innovative threats altering the landscape of the security arms race. But are these attacks really new? A quick glance at history shows us that these same attacks and defenses have been around for as long as there have been humans. Come hear about the ancient Greek firewalls (and firewall bypasses), about Roman security-by-obscurity, ancient port-scanning, and about Mozart's “rights amplification” against the Pope. This will be a trip through the ages as the security arms race is analyzed. You’ll discover how we got where we are today and learn that even in security, history is always repeating itself.","timestamp":"1279454400","location":"Lovelace","speakers":[{"name":"Bill Cheswick","bio":"is an early innovator in Internet security. He is known for his work in firewalls, proxies, and Internet mapping at Bell Labs and Lumeta Corp. He is best known for the book he co-authored with Steve Bellovin and now Avi Rubin, <i>Firewalls and Internet Security: Repelling the Wily Hacker.<\/i> He is now a member of the technical staff at AT&amp;T Labs Research in Florham Park, New Jersey, where he is working on security, visualization, user interfaces, and a variety of other things."},{"name":"Matt Blaze","bio":"is an associate professor of computer and information sciences and director of the Trusted Network Eavesdropping and Countermeasures project at the University of Pennsylvania. His research interests include secure systems, cryptology and cryptographic protocols, and large-scale systems."},{"name":"Sandy Clark (Mouse)","bio":"has been taking things apart since the age of two, and still hasn't learned to put them back together. An active member of the hacker community, her professional work includes an Air Force Flight Control computer, a simulator for NASA, singing at Carnegie Hall, and a minor in history. She is currently fulfilling a childhood dream, pursuing a Ph.D. in C.S. at the University of Pennsylvania. A founding member of Toool-USA, she also enjoys puzzles, toys, Mao (the card game), and anything that involves night vision goggles. Her research explores human scale security and the unexpected ways that systems interact."}]},{"id":"27","title":"Cats and Mice: The Phone Company, the FBI, and the Phone Phreaks","description":"Ever since the first blue box arrest in 1961, the telephone company, the FBI, and the phone phreaks engaged in a long-running game of cat and mouse. This talk explores the moves and countermoves between the two sides from 1960 to 1980, covering advances in phreaking - new ways to hack the phone system and evade detection - as well as advances in finding and prosecuting those pesky phone phreaks. Based on exclusive interviews with phreaks, FBI agents, and telephone company security officers for his forthcoming book on the history of phone phreaking, Phil will focus on some of the more dramatic battles between the two sides that occurred during the heyday of analog phone phreaking, including the 1962 Harvard “spy ring,” a certain well-known phone phreak’s wiretapping of the FBI in 1975 (yes, you read that right), and the hacking of the military’s AUTOVON telephone network in the mid-1970s.","timestamp":"1279454400","location":"Tesla","speakers":[{"name":"Phil Lapsley","bio":"has spent the last several years documenting the history of phone phreaking, through hundreds of interviews and Freedom of Information Act requests. He has been interviewed by National Public Radio and the BBC and quoted in multiple newspapers, including <i>The New York Times,<\/i> on the topic. He has also presented on phone phreaking history at the 10th Annual Vintage Computer Festival and The Last HOPE. When not researching phreaking, Phil has tried to act like an upstanding member of society. He cofounded two high technology companies in the San Francisco Bay Area and worked for McKinsey and Company, a management consulting company that advises Fortune 100 companies on business strategy. He holds B.S. and M.S. degrees in electrical engineering and computer sciences from U.C. Berkeley and an MBA from the MIT Sloan School of Management. He codeveloped Network News Transfer Protocol (NNTP, RFC 977) used in the USENET news system. He is also the author of one textbook, 17 patents, and numerous technical articles."}]},{"id":"25","title":"Burning and Building Bridges: A Primer to Hacking the Education System","description":"Public education today consists of underpaid, overworked, and generally dissatisfied teachers who are tasked with force-feeding students overwhelming amounts of information, perfectly regurgitated onto multiple-choice exams. State exams, for their part, are written by people who understand neither content nor students. Over the years, we have successfully created an education system that stifles creativity, stymies logical reasoning, and stunts learning. Long gone are the days of self-motivated learning, when children used their hands and their heads, piecing the world together with all their senses.\r\nFortunately, we have hackers and hackerspaces. Makerspaces and art spaces, music spaces and theater spaces. Here are the last vestiges of true education, where individuals still take objects and learn from them - observe, break apart, analyze, fix, and piece back together. If we can accept the productive and creative capacities of such spaces, and use them as community centers for learning, we have the potential to become the next big force in public education. This talk will be about hacking education as we hack anything else. That is, break the existing system, throw out what gets in the way (tests, outdated formulas, teacher-centric classrooms), reconstruct the pieces conducive to learning (inquiry, manipulatives, the outdoors, the real world, use of tools), and piece back together an education system that works for us, rather than against us.","timestamp":"1279454400","location":"Bell","speakers":[{"name":"Christina 'fabulous' Pei","bio":"is a Wall Street analyst turned math teacher turned math pirate. After working in New York City public schools for three years teaching grades 6-12, she now works for Paul Sally, the University of Chicago 'math pirate' who has been hacking math education for decades. She helps promote hacker and maker spaces everywhere, and has appeared in panels with noteworthy educators, including the controversial William Ayers."}]},{"id":"108","title":"TrackMeNot: Injecting Reasonable Doubt in Everyone’s Queries","description":"TrackMeNot is a lightweight Firefox extension that helps protects web searchers from surveillance and data-profiling by search engines. It does so, not by means of concealment or encryption (i.e., covering one's tracks), but instead, paradoxically, by the opposite strategy: noise and obfuscation. Because any query can plausibly be artificial, everyone’s search history ownership is now subject to a reasonable doubt. The challenge that TrackMeNot encounters is to search as a human. The adversary, a search engine capable of mining billions of user queries, should not be able to filter the artificially generated queries. Ideally, even a human should not be capable of filtering the queries that have been injected.\r\nThis talk will also detail the motivations in developing TrackMeNot: lack of transparency of search engines’ use of data and ambiguity of the privacy policies. Key elements of TrackMeNot implementation will be described and evidence will be revealed proving that a major search engine profiling algorithm is influenced by the use of TrackMeNot.","timestamp":"1279458000","location":"Bell","speakers":[{"name":"Vincent Toubiana","bio":"is a postdoctoral researcher at New York University (NYU) working on web search privacy and obfuscation. Before joining NYU, he worked at Alcatel-Lucent as research engineer. He obtained his Ph.D. in computer science at Telecom ParisTech (French National School of Telecommunications) in 2008."}]},{"id":"36","title":"The DMCA and ACTA vs. Academic and Professional Research: How Misuse of This Intellectual Property Legislation Chills Research, Disclosure, and Innovation","description":"Fair use, reverse engineering, and public discussion of research encourage innovation and self-regulates industries. However, these principles which define our vibrant and creative marketplace are fading. If a professional cannot constructively critique another’s research online without being burdened with takedown notices until the critique is obscured or functionally removed for long periods of time, we do not have a society from which we can learn from others’ mistakes and improve our trade.\r\nAttendees will gain a greater appreciation about how the Digital Millennium Copyright Act (DMCA) is increasingly being used in ways that chill free speech, disclosure of security vulnerabilities, and innovative research. Using hypothetical examples and discussing case law, this talk will outline procedures for counterclaiming and alternatives to removal of allegedly infringing materials, including discussing why data havens (some in anticipation of enactment of the Anti-Counterfeiting Trade Agreement) are becoming more popular.","timestamp":"1279458000","location":"Tesla","speakers":[{"name":"Chris Mooney","bio":"is a software engineer who works in the high performance and high availability problem space. He has a B.S. in computer science and a minor in mathematics at the University of Southern Maine. He is the current executive director of Project DoD Inc., a 501(c)(3) charitable technology nonprofit with a focus on censorship resistant services. He has always been interested in computer security, and has focused a good deal of time on cryptology and computer security research. His web page is at: https:\/\/chris.dod.net\/."},{"name":"Tiffany Rad","bio":"is the president of ELCnetworks, LLC., a technology, law, and business development firm with offices in Portland, Maine and Washington, D.C. Her consulting projects have included business and tech analysis for startups and security consulting for U.S. government agencies. She is also a part-time adjunct professor in the computer science department at the University of Southern Maine, teaching computer law and ethics and information security. Tiffany also researches car computers, is president of the reverse engineering and development company Q Labs, is the director\/founder of Reverse Space, a hackerspace in northern Virginia, and is pro bono legal counsel for Project DoD, a nonprofit hosting company with censorship resistant services. Her website is http:\/\/www.tiffanyrad.com."}]},{"id":"16","title":"American Bombe: How the U.S. Shattered the Enigma Code","description":"Many people know the story of Alan Turing and his work at Bletchley Park in designing the British bombes, the machines used to crack the German Enigma codes. What most people don't know is what happened afterward. When the German military added a fourth rotor to the Enigma, a new type of machine was needed in order to crack the codes and keep Allied intelligence out of darkness. These American bombes were the first multifunction computers ever built, and are an important part of the history of modern computing. It's the incredible, gripping story of an enterprise that rivaled the Manhattan Project in secrecy and complexity, and ultimately led to the first modern digital computer.","timestamp":"1279458000","location":"Lovelace","speakers":[{"name":"Shalom Silbermintz","bio":"(Spam) is your average, everyday I.T. ninja. If he's not breaking computers, he is probably watching far too much television for his own good. He is also probably the only person in history to ever pick up a soldering iron by the wrong end (in case you were wondering, that did not end well)."}]},{"id":"64","title":"Informants: Villains or Heroes? (90 minutes)","description":"We’ve all seen the headlines and know that much of the controversy has a presence right here at HOPE. For those who don’t know, or who just want a summary, one of our keynote speakers, Julian Assange, the main force behind whistleblower site wikileaks.org, became a marked man after one of his sources was allegedly identified by someone within the hacker community. The leaker had reportedly boasted to hacker Adrian Lamo (after seeing his name in a <i>Wired<\/i> article) about sending 260,000 U.S. State Department classified documents to wikileaks.org. According to Lamo, that claim was enough to make him decide to call the authorities and become an informant. The U.S. government became extremely interested in finding out whether Assange had these documents at wikileaks.org and it became abundantly clear that his appearance in the States to speak at HOPE would lead to interrogations, detainment, and possibly worse. At press time, the alleged leaker (an Army intelligence analyst), was being held incommunicado in a U.S. Army brig in Kuwait pending charges.\r\nOur community has been thrust into the middle of this global controversy due to the multiple connections to the various players. There are a number of contentious questions and issues that we’re all dealing with right now. Was the leaker a hero for releasing information, including a widely sought video of U.S. troops killing unarmed Reuters staffers? Was Lamo a hero for turning someone in who was leaking classified information? Is wikileaks.org a vital resource or a threat to society? How should we as a community deal with this? And is this story being reported accurately and fairly?\r\nJoin us for what will be a most fascinating and enlightening panel discussion where you’ll hear firsthand perspectives on the issues of leaking information and turning people in, subjects that have always been of great interest to those in the hacker world. If you made plans to go home Sunday afternoon, this is worth rescheduling your trip <i>and<\/i> paying any penalties involved. Trust us.","timestamp":"1279461600","location":"Tesla","speakers":[]},{"id":"67","title":"Into the Black: DPRK Exploration","description":"North Korea scares people. Allegedly, the DPRK has a super l33t squad of killer haxor ninjas that regularly engage in hit and run hacks against the Defense Department, South Korea, or anyone else who pisses off the Dear Leader. The DPRK also has no real Internet infrastructure to speak of (as dictators don't like unrestricted information), although it does have a number of IP blocks. This talk examines some of the myths about the DPRK, and some of their existing and emerging technologies. Some of the available infrastructure associated with DPRK (funnily enough, some of which is in South Korea and Japan) will be discussed and the potential technical threats posed by a pernicious regime analyzed.","timestamp":"1279461600","location":"Lovelace","speakers":[{"name":"Michael Kemp","bio":"(clappymonkey) is an experienced U.K. based security consultant, with a specialization in the penetration testing of web applications and the testing of compiled code bases and DB environments to destruction. As well as the day job, Michael has been published in a range of journals and magazines, including <i>heise, Network Security, Inform IT,<\/i> and <i>Security Focus.<\/i> To date, Michael has worked for NGS Software, CSC (Computer Sciences Corporation), British Telecom, and a host of freelance clients throughout the globe. Presently, Mike is working in a day job for Xiphos Research Labs. When not breaking things, Michael enjoys loud music, bad movies, weird books, and writing about himself in the third person."}]},{"id":"45","title":"The Freedom Box: How to Reclaim Privacy on the Web","description":"The world has finally realized that \"spying all the time\" is too high a price to pay for social networking platforms like Facebook. Now it's up to the hacker community to respond and build a free software social networking distribution to empower end users and help them reclaim their privacy. Software Freedom Law Center attorney James Vasile will talk about the progress of the \"Freedom Box\" box project and how the hacker community can get involved.","timestamp":"1279461600","location":"Bell","speakers":[{"name":"James Vasile","bio":"is an attorney at the Software Freedom Law Center (SFLC) and a longtime advocate of free software and free culture. He has advised major free software projects like GNOME, Apache, Drupal, and Joomla. Alongside his work at the SFLC, James writes software for the Book Liberator project and produced the last two New York Software Freedom Day celebrations. He serves on the board of several freedom-oriented non-profits and writes about freedom, technology, and community at his blog, Hackervisions.org."}]},{"id":"32","title":"CV Dazzle: Face Deception","description":"As CCTV camera networks proliferate worldwide, so do automated face detection\/recognition systems, which can rapidly identify faces in crowds and covertly log individuals' movements. CV Dazzle is camouflage from face detection. It's based on the original Dazzle camo from WWI and thwarts automated face detection\/recognition systems by altering the contrast and spatial relationship of key facial features. Developed as a challenge to the growing prowess of computer vision, CV Dazzle undermines the capabilities of visual capture systems under the guise of high-fashion aesthetics.","timestamp":"1279465200","location":"Lovelace","speakers":[{"name":"Adam Harvey","bio":"is a designer and technologist who researches and develops new uses for, or against, new technology. He is a recent graduate of the Interactive Telecommunications Program at NYU and has been featured on Reuters, CBC, <i>The Register, Wired,<\/i> and in the 2009 edition of <i>Advances in Wearable Computing.<\/i>"}]},{"id":"18","title":"Bakeca.it DDoS - How Evil Forces Have Been Defeated","description":"What if your infrastructure was attacked by a skilled and powerful organization, able to control many zombies all around the world? A real case history will be analyzed, with a long trip through sleepless nights, finishing with a DIY solution using OpenBSD based servers and a bit of cleverness, all of which eventually led to a happy ending.","timestamp":"1279465200","location":"Bell","speakers":[{"name":"Alessio 'mayhem' Pennasilico","bio":"lives and works in Verona (Italy) as a security evangelist for Alba S.T. s.r.l. His personal and working interests are information technology, security issues, open source and digital rights. He is usually a speaker at most of the Italian national events such as SMAU, Infosecurity, E-privacy, Linux Day, OpenCon, OpenEXP, ESC and the Italian HackMeeting. He also holds workshops in secondary schools and Italian universities, with the aim of spreading the culture for an awareness of today"}]},{"id":"58","title":"Hacking the Food Genome","description":"Cooking's pretty awesome, but meatspace is such a drag! Can't you just write a shell script to figure out what's delicious? What would the programming language for the Star Trek Food Replicator look like? Join Gweeds and the Food Hacking team for an in-depth demonstration of the Food Genome - an open source culinary informatics platform used for designing menus, disassembling recipes, and visualizing the planet's taste gestalt.","timestamp":"1279467000","location":"Tesla","speakers":[{"name":"Gweeds","bio":"is a food hacker who programs food in his spare time. He also enjoys scraping and analyzing the world's culinary data and cooking with freaks in hacker kitchens across the world."}]},{"id":"20","title":"The Black Suit Plan Isn't Working - Now What?","description":"The suit plan isn't working. At The Last HOPE, James told you all about the awesomeness of The Black Suit. But you're finding that it's not really working out... maybe it’s possible to lower the goal? Can we take advantage of the Econopocalypse, the fact that two years have gone by, and infiltrate the upper echelons without having to leave the Black Hat behind? With cyber humor, blistering criticism, and awesometastic possibilities, spend some time in a discussion about ways to get to the place we all want to be - employed <i>and<\/i> happy.","timestamp":"1279468800","location":"Bell","speakers":[{"name":"James Arlen","bio":", sometimes known as Myrcurial, is a security consultant usually found in tall buildings wearing a suit, founder of the Think|Haus hackerspace, columnist at <i>Liquidmatrix Security Digest,<\/i> Infosec geek, hacker, social activist, author, speaker, and parent. He's been at this security game for more than 15 years and loves blinky lights and shiny things."}]},{"id":"52","title":"Hackers without Borders: Disaster Relief and Technology","description":"An hour long, multimedia presentation examining the past, present, and future roles that digital and wireless technology can play on the ground during natural and manmade disasters. This discussion will examine why government (FEMA and the National Guard) and big relief organizations (Red Cross and Salvation Army) have gotten the basic premises of disaster relief wrong, using Katrina and 9\/11 as examples. Ingenious, informal technological innovations emerging during disasters that promoted effective self-organized relief efforts will be focused upon. The panel will also look at how the hacker communities can create novel and powerfully effective technologies to aid people, and support grassroots self-organizing during disasters.","timestamp":"1279468800","location":"Lovelace","speakers":[{"name":"Dennison Williams","bio":"is a member of the Hackbloc and March Hare collectives, lead developer of the Tapatio project, and thinks skunks are way cuter then raccoons."},{"name":"Elena","bio":"is a cofounder of the Aftershock Action Alliance and a professional urban planner. She did relief work in New Orleans for Common Ground after Katrina."},{"name":"Smokey","bio":", cofounder of the Aftershock Action Alliance, organized the first Emergence Broadcast System and was recently arrested and had his home raided by the Joint Terrorism Task Force for working with the Tin Can Communications Collective during the G-20 protests in Pittsburgh. He also presented at HOPE a few years back with the People's Law Collective about PATRIOT Act and Emerging Technologies."}]},{"id":"61","title":"The HOPE Network","description":"At every last one of our conferences, something epic happens with the network we put together. Sometimes it involves international headlines, government investigations, and emergency corporate board meetings. Other times something spectacular happens. Either way, we’re setting aside an hour at the end of the conference to explain just what happened and how it all came to be.","timestamp":"1279472400","location":"Tesla","speakers":[]},{"id":"99","title":"Sniper Forensics - Changing the Landscape of Modern Forensics and Incident Response","description":"At one time, computer forensics consisted of pulling the plug, imaging everything in sight, and loading those images into a massive forensics program for “analysis.” As computer hackers became more resourceful, the complexity of computer forensics increased exponentially. Add to that the growing size of data storage devices, and it becomes infeasible to even consider imaging tens or hundreds of terabytes, let alone loading those images into some forensic software. So what's the answer? How can incident responders hope to remain relevant in today's operating environment? With Sniper Forensics! In addition to offering tips and tools, this talk will provide real world examples of how the landscape of modern forensics is being changed.","timestamp":"1279472400","location":"Lovelace","speakers":[{"name":"Chris Pogue","bio":"is a senior security analyst for the Spiderlabs incident response and digital forensics team at Trustwave. He has over ten years of administrative and security experience including three years on the IBM ISS X-Force emergency response services team, five years with IBM"}]},{"id":"29","title":"Closing Ceremonies","description":"This is really worth sticking around for, as so many people do. Sure, there are those who leave early on Sunday because they have to get back to whatever it is they do in the real world bright and early Monday morning. But if you fancy something a bit more celebratory and different, we suggest you stick around as the conference truly winds down. This is where you hear some of the back story of the conference, get a chance to win some prizes, and hopefully help us put the hotel back in the state in which we found it. Maybe even a better state.\r\n[Speaking of the hotel, at press time it appears that a major public hearing will be taking place the day after HOPE concerning the proposed demolition of the hotel where public opinion will be sought. If this remains the case, there will never be a better opportunity to show those in charge how important the Hotel Pennsylvania is to the world. You don’t have to be from New York to participate - in fact, the more people from all parts of the globe who speak up, the better. We will have updated information on this throughout the conference.]\r\nWe hope to see even more people than the usual huge mob for this special closing.","timestamp":"1279476000","location":"Tesla","speakers":[]}]